{"govPageLinks": {"title": "govpage-private-sector", "blogPosts": [{"imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/vw-group-sa_orig.gif", "href": "https://www.govpage.co.za/private-sector-jobs/volkswagen-group-is-hiring", "title": "VOLKSWAGEN GROUP IS HIRING", "content": [" \nPROJECT ENGINEER\nThe future of mobility is changing. What do we contribute to this? Volkswagen produces vehicles in 14 countries and delivers them to customers in more than 150 markets worldwide. Electromobility, smart mobility and digital transformation are our core topics for the future. For many millions of people, Volkswagen is the epitome of mobility- not only today, but also tomorrow. Become part of it and help develop new solutions with your curiosity and ideas. You can expect a diverse team that supports you and with whom you can grow together and develop your potential.\n\nApplications are invited from suitably qualified & experienced candidates to fill the Project Engineer position in the Quality Assurance Department - Kariega\n \nBrief Role Description\nTo plan, define and coordinate the Quality release of new projects, facilities, components and locally produced products according to Group Quality, Cost and productivity targets by strict adherence to the Product Emergence Process (PEP).\n \nPossible Tasks within this Role\nEnsuring that the new vehicle evaluation/validation (Model change and New Projects) is carried out to the laid down Konzern guidelines.  Make recommendations regarding PVS (Pre-Series Build) and O-Series vehicle build status, for the pending SOP (Start of Series Production) release of the new product at the required timing.\nCommunicating with VW/Audi AG on all new project related topics.\nRepresenting QA Division in Project meetings, assess decision requirement, prepare and submit requirements to Project Team.\nAssessing and co-ordinating all proposed changes (PP, ECR, Deviations, and Localization) for their impact on the business\nPlanning the introduction of changes according to Group guidelines to minimize risk to Production.\nGenerating project investment requirements on behalf of Quality.\nDetermining manpower requirements for SKD, MKD and CKD operations.\nAnalysing the cause of non-conformances reported through validation drives and co-ordinating the problem resolution process with the responsible departments.\n \nQualification requirements\nBSc degree /National Diploma in Mechanical/Electrical Engineering\n \nExperience needed\nHave a minimum of 5 years Engineering experience.\nHave 3 – 5 years Project Management experience\n \nEssentials\nThorough working knowledge of Automotive (Technical, Quality and Design functions).\nKnowledge of Conformity of Series Production and associated legal requirements of worldwide export markets.\nWorking experience of statistical techniques and quality tools\nWorking knowledge of ISO 9000 / VDA-6 elements / OHS and philosophy\n International interaction\n German language (speak, read, and write)\n \nAt Volkswagen, we value an inclusive and diverse culture. We offer a trustworthy environment because we live up to our corporate values, Respect/Integrity/Excellence/One Team. Applications must be submitted via the online system by no later than Thursday, 18th July 2024 .  All queries can be raised with Bahieya Dolley , Ext 4565 or e-mail ssf.recruitment.vwsa.r.uit@vwsa.co.za\n \nJob ID:  8610\nCompany:  Volkswagen Group South Africa (Pty) Ltd\nLocation:   ZA\nDepartment:  Quality\nCareer Level:  Professionals\nShift:  Full-time\nContract type:  Unlimited\nRemote Working:  Mobile Work not possible\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer :\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address: ssf.recuitment@vwsa.co.za\n \nMore information: Volkswagen South Africa\n \nAPPLY NOW »\n \n \n \n ", " \n \n \n \nQUALITY FUNCTION ENGINEER (F/M/D)\n \nBrief Role Description\nTakes care of quality of customer functions, evaluation, release criteria and approval.\n \nPossible Tasks within this Role\n \nQualification requirements\nRelevant Soft Skills\nLateral thinking\nQuality orientation\nObservation skills\nAnalytical thinking\n \nRelevant Hard Skills regarding…\nApproval processes\nQuality assurance\nTechnical inspection\nProcess management\nCorrective and preventive action\nPreventive maintenance\nProject management\nFunctional specification\nProduct quality analysis\nQuality management system\nInspection method\nQuality audit\nQuality control\nEvaluation (quality management)\nDocumentation\n \nJob ID:  5716\nCompany:  Volkswagen Group South Africa (Pty) Ltd\nLocation:  ZA\nDepartment: Quality\nCareer Level:  Professionals\nShift:  Full-time\nContract type:  Unlimited\nRemote Working:  Mobile Work not possible\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer:\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address ssf.recuitment@vwsa.co.za\n \nMore information: Volkswagen South Africa\n \nAPPLY NOW »\n \n \n \n ", " \n \n \n \nAUDI SALES OPERATIONS MANAGER\n \nThe future of mobility is changing. What do we contribute to this? Volkswagen produces vehicles in 14 countries and delivers them to customers in more than 150 markets worldwide. Electromobility, smart mobility and digital transformation are our core topics for the future. For many millions of people, Volkswagen is the epitome of mobility- not only today, but also tomorrow. Become part of it and help develop new solutions with your curiosity and ideas. You can expect a diverse team that supports you and with whom you can grow together and develop your potential.\n \nApplications are invited from suitably qualified & experienced candidates to fill the Audi Sales Operations Manager position in the Audi Department - Sandton\n \nBrief Role Description\n Based in Sandton in Audi Brand, the successful incumbent will be responsible to lead the development and delivery of Audi SA’s operational strategy; and management of sales programmes and Audi Financial Services strategy, co-ordinate the Dealer field team activities, and provide a communication platform to the Dealer Council and AUDI AG on all sales related matters\n \nPossible Tasks within this Role\nAnalyse economic conditions affecting the motor industry, identify retail opportunities, formulate retail strategies\nDevise plans to steer market share, model penetration and mitigate against risks \nFacilitate and co-ordinate work scheduling and process flows between various departments\nEnsure efficiencies between Audi Supply Chain and Audi Sales: Dealer allocations, Dealer ordering/ specification, transportation, bond clearances, aged stock and Dealer wholesale\nCollaborate with Product Marketing and Dealer Academy; and engage with Dealer Network management\nContribute to marketing activities that drive specific sales and Brand building campaigns\nMonitor:  retail and wholesale development and accessories performance; devise strategies and propose incentives.\nManage the incentive budget and approve monthly/ quarterly payouts\n  Analyse various reports including Audi Financial Services, business systems and operational processes\nFoster positive working relationship with Franchise Directors, Dealer Principals and portfolio managers\nConsult with Audi NDAC and the relevant Subcommittee on Sales and Marketing\nDefine business requirement for Sales analysis, implement and oversee the output\nDevelop, support and implement Audi Financial Services initiatives.\nLead a team of Regional Sales Managers and Sales Analyst\n \nQualification requirements\nA recognised 3-year National Diploma/Bachelor's Degree in Marketing/Commerce/Engineering/Business Managment\n \nExperience Needed\nMinimum 10 years’ Management experience\nMinimum of 5 years motor industry experience, ideally within Sales & Brand / Volume & Supply Chain Planning / Product Planning\nMinimum 3 - 5 years’ experience as a Regional Sales Manager\n\nEssentials\nStrategic thinking and application\nAbility to listen and communicate effectively at all levels, written and verbal.\nCommercially astute with proven track record of adding value and achieving targets.\nAbility to effectively negotiate and make decisions at a Senior company, Dealer and Supplier level.\nBusiness understanding of automotive market and competitive environment.\nUnderstanding of financial principles and business management.\nSound understanding of the Marketing/ Sales environment as well as brand principles.\nLeadership and team management skills.\nProduct and retail selling knowledge.\nPassion for automotive retail and marketing disciplines\n\n \nAt Volkswagen, we value an inclusive and diverse culture. We offer a trustworthy environment because we live up to our corporate values, Respect/Integrity/Excellence/One Team. Applications must be submitted via the online system by no later than  Wednesday 17th July 2024 .  All queries can be raised with Bahieya Dolley , Ext 4565 or e-mail ssf.recruitment.vwsa.r.uit@vwsa.co.za\n \nJob ID:  7929\nCompany:  Volkswagen Group South Africa (Pty) Ltd\nLocation: ZA\nDepartment:  Sales\nCareer Level:  Management\nShift:  Full-time\nContract type:  Unlimited\nRemote Working:  By agreement\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer :\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address ssf.recuitment@vwsa.co.za\n \nMore information: Volkswagen South Africa\n \nAPPLY NOW »\n \n \n \n ", " \n \n \n \n \nOD & ENGAGEMENT CONSULTANT\n \nThe future of mobility is changing. What do we contribute to this? Volkswagen produces vehicles in 14 countries and delivers them to customers in more than 150 markets worldwide. Electromobility, smart mobility and digital transformation are our core topics for the future. For many millions of people, Volkswagen is the epitome of mobility- not only today, but also tomorrow. Become part of it and help develop new solutions with your curiosity and ideas. You can expect a diverse team that supports you and with whom you can grow together and develop your potential.\n \nApplications are invited from suitably qualified & experienced candidates to fill the OD and Engagement Consultant position in the Learning Academy Department (Human Resources) – Kariega\n \nBrief Role Description\nBased in Kariega (B-Plant) and reporting into the Leadership Academy structure, the incumbent is responsible for developing, implementing and tracking various organisational and leadership development initiatives across all levels of the organisation to drive improved levels of employee engagement\n \nPossible Tasks within this Role\nSupport various learning projects and learning experience designs to ensure timely and effective delivery of the right learning to the right people including developing, piloting and evaluating new learning and leadership development programs\nSupport the development and implementation of innovative and measurable learning journeys using diverse modalities, including digital learning, on-the-job training, blended learning, mobile learning, performance support, and simulations\nConsult pro-actively with line management and organisational units to identify underlying team and organizational culture/ climate factors that may enhance or detract from the team’s group cohesion and engagement\nCollaborate with various cross-functional teams and departmental leaders to align OD and engagement interventions and activities with business goals\nFacilitate the design and delivery of relevant in-house OD and engagement events (e.g. team discussions, engagement workshops, away days) to grow and build team engagement\nProvide support to the Volkswagen Assessment Centre department and associated progression and competency assessment processes\nServe as local contact and liaison with central Volkswagen Group AG Survey team network on matters related to local and international Group employee engagement and organisational climate survey processes\nCompile and distribute relevant communication packages by working collaboratively with the Internal Communications department to ensure effective communication of organisational development and engagement processes to the organisation\nMonitor the relevant departmental budgets through forecasting, tracking and reconciling expenditure against planned spend and pro-actively following up on out–of–line situations\nCollaborate with department stakeholders to share ideas, leverage synergies, and promote a culture of learning across the organization\nManage and ensure integrity of the learning management system to include working with external vendors, system upgrades, data maintenance, and advocacy\n \nQualification requirements\nHold at least a formal 3 year Bachelor’s degree from a recognised tertiary institution, preferably with majors in Human Resource Management/ Industrial Psychology/ Organisational Development.\nAdditional professional registration/ accreditation status as Industrial Psychologist and/ or certified coach will carry a distinct advantage\n \nExperience needed\nA minimum of 3 - 5 years in the field of Human Resource Management, ideally gained within one or more of the following HR fields; Learning and Development, HR Consulting/ Business Partnering, Assessment and Diagnostics\n \nEssentials\nWorking knowledge of SAP SuccessFactors will be a plus\nKnowledge of employee engagement/ motivation methodologies, concepts, techniques and tools\nKnowledge of change management processes\nAble to analyze OD training needs, evaluate intervention effectiveness and provide recommendations to promote a high performance culture\nExcellent verbal, written and interpersonal skills.\nModel company values and demonstrate the ability to establish personal credibility quickly and build trust with colleagues and teams across all levels\nWell-developed facilitation skills and exhibit a passion for team coaching\nHave the capacity to mediate and manage conflict situations constructively\nSound project management skills\nGood analytical skills with keen attention to detail\nHave the ability to manage budgets, control financial administration and expenditure\nHigh level of energy, work commitment, initiative and resourcefulness\nBe a pragmatic, solution-oriented self-starter with the ability to adapt easily to changing priorities and business needs\nBe willing and able to work outside of normal office hours in accordance with operational business needs/ customer area requirements\nBe willing and able to travel locally and abroad in the ambit of the position\nBe fully proficient in MS Office with good report preparation/ presentation skills\n \nAt Volkswagen, we value an inclusive and diverse culture. We offer a trustworthy environment because we live up to our corporate values, Respect/Integrity/Excellence/One Team. Applications must be submitted via the online system by no later than Wednesday, 17th July 2024.  All queries can be raised with Bahieya Dolley , Ext 4565 or e-mail ssf.recruitment.vwsa.r.uit@vwsa.co.za\n \nJob ID:  8598\nCompany: Volkswagen Group South Africa (Pty) Ltd\nLocation: ZA\nDepartment:  Human Resources, Organisation and Diversity\nCareer Level:  Professionals\nShift:  Full-time\nContract type:  Unlimited\nRemote Working:  Up to 40%\nPosting Date:  9 Jul 2024\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer:\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address ssf.recuitment@vwsa.co.za\n \nMore information: Volkswagen South Africa\n \nAPPLY NOW »\n \n \n \n ", " \n \n \n \n \nTEMPORARY TECHNICAL DATA ANALYST\n \nThe future of mobility is changing. What do we contribute to this? Volkswagen produces vehicles in 14 countries and delivers them to customers in more than 150 markets worldwide. Electromobility, smart mobility and digital transformation are our core topics for the future. For many millions of people, Volkswagen is the epitome of mobility- not only today, but also tomorrow. Become part of it and help develop new solutions with your curiosity and ideas. You can expect a diverse team that supports you and with whom you can grow together and develop your potential.\n \nApplications are invited from suitably qualified & experienced candidates to fill the Temporary Data Analyst position in the Logistics Department – Kariega\n \nBrief Role Description\n To provide accurate bills of materials (BOMs) for series and pre-series parts to internal and external supply chain partners for the production of vehicles and/or components destined for in-house-, local-, and export customers. To manage the successful introduction of engineering changes in series and pre- series production. To identify, analyse, and report / communicate out of line bill of material situations and ensure commitment to corrective actions. To advance the management of part number variance in the plant to ensure optimal products to satisfy internal and external customers.\n \nPossible Tasks within this Role\nEvaluating the impact of engineering changes on the BOMs and providing accurate input into the change management system.\nConverting the Engineering Bill of Material (E/BOM) into a Production Bill of Material (P/BOM)\nDetermining timing for the introduction of engineering changes at VWSA by considering the lead plant timing, related changes, supplier (local and foreign) lead times, inventory levels, vehicle definitions and customer requirements\nSecuring continued supply of imported material for production of vehicles and components by coordinating the “Neuteile” (New Components) request process. \nIntervening in the P/BOM to prevent line stoppages through the implementation of temporary changes (deviations) to correct errors in usage, PR number, color, and trim combinations as well as effective period. \nEnsure correct documentation is put in place for the permanent correction of temporary intervention.\nProviding accurate BOMs to JIT-, JIS and kit suppliers on a continuous basis (as the vehicle passes through the production process) for the production of sub-assemblies.\nInvestigating ad-hoc data queries related to the P/BOM to ensure the accuracy of the BOM so that parts are delivered timeously to the relevant Production areas.\n \nQualification requirements\nND/Degree in Mechanical/ Industrial /Electrical Engineering or Production Management/ Supply Chain Management /Logistics/ Information Technology/ Data Science\n \nExperience needed\nAt least 3 years’ experience gained within the automotive industry in a Logistics environment\n \nEssentials\nWorking knowledge of VW Group Technical Data/Engineering Change Processes and Engineering Systems and BOM (Bill of Material).\nUnderstanding of the Vehicle build processes.\nUnderstanding of RPA (Robotic Process Automation)\nProject Management Experience\nComputer literate, Microsoft Office Package (Word; Excel & PowerPoint) SAP\nAbility to communicate at all levels (Good written and verbal communication skills.)\nBe analytical skills with an innovate approach to problem – solving\n \nAt Volkswagen, we value an inclusive and diverse culture. We offer a trustworthy environment because we live up to our corporate values, Respect/Integrity/Excellence/One Team. Applications must be submitted via the online system by no later than Friday, 12th July 2024.  All queries can be raised with Bahieya Dolley , Ext 4565 or e-mail ssf.recruitment.vwsa.r.uit@vwsa.co.za\n \nJob ID:  8203\nCompany:  Volkswagen Group South Africa (Pty) Ltd\nLocation:  \nZA\nDepartment:  Production and Logistics\nCareer Level:  Professionals\nShift:  Full-time\nContract type:  Fixed-term\nRemote Working:  By agreement\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer:\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address ssf.recuitment@vwsa.co.za\n \nMore information: Volkswagen South Africa\n \nAPPLY NOW »\n \n \n \n ", " \n \n \n \nPRODUCT LEADER: PRODUCT IMPLEMENTATION AND LIFECYCLE MANAGEMENT\n \nThe future of mobility is changing. What do we contribute to this? Volkswagen produces vehicles in 14 countries and delivers them to customers in more than 150 markets worldwide. Electromobility, smart mobility and digital transformation are our core topics for the future. For many millions of people, Volkswagen is the epitome of mobility- not only today, but also tomorrow. Become part of it and help develop new solutions with your curiosity and ideas. You can expect a diverse team that supports you and with whom you can grow together and develop your potential.\n \nApplications are invited from suitably qualified & experienced candidates to fill the Product Implementation and Lifecycle Management position in Corporate Strategic Division - Kariega\n \nBrief Role Description\nThis position is responsible for the timely assessment and implementation of Change Management (Aeko’s) and Lifecycle activities, for vehicle projects defined as products predominantly for export markets, as instructed by the Group Board. This position is also responsible for special model introduction project management to keep the models relevant as per customer and regional requirements.   Collates and prepares the presentations to for approval of the funds to top management for the project changes post milestone PF as well as Model Year. Ensuring that the approval request is agreed cross divisionally and does not negatively impact the business from a financial and overall plant efficiency perspective.\n\nPossible Tasks within this Role\nPlan, lead and organise local cross-divisional meetings to ensure successful project implementation.\nReview open tasks and deadlines using timing plans to achieve a successful start of production (SOP).\nMotivate and encourage team members by providing the necessary support, guidance and platform where open communication is encouraged to ensure products meet customer requirements while being economically viable.\nRepresent VWGA at local and international product and platform team meetings to maintain the information flow.\nConsolidate divisional input to be submitted for Aeko’s (investment, timing), and coordinate local Aeko meetings in preparation for Group forums in order to represent VWGA at international Aeko [Change Point] meetings thus ensuring changes are financially feasible and divisional inputs are plausible.\nRepresent VWGA in model year meetings ensuring both the HUT and Platform changes in Brazil and Skoda respectively are implemented for the local product where necessary to ensure vehicle buildability.\nRepresent the department in all complexity and variant reduction forums.\nInterfacing with the Fachgruppen (Specialist Group) team leaders by setting up regular feedback sessions to ensure part readiness for a successful SOP.\nPrepare business cases with cross-divisional input for local and international forums by ensuring all divisions timeously provided their cost impact for Finance to create a business case.\nDevelop strategy recommendation presentations for VWGA production by liaising with international Project Leader counterparts ensuring that the best suited product is developed and built.\nEvaluate cross-divisional impact of decisions to mitigate risks for the organisation.\nManage projects within approved budgets, resources and timelines to get a financially viable product that meets market requirements.\n \nQualification requirements\nA 3-year tertiary qualification in Engineering, Marketing or Finance discipline\n A formal qualification in Project Management.\n\nExperience needed\nA minimum of 3 years’ project management experience from Product definition to End of product\n\nEssentials\nThe ability to prepare professional, comprehensive presentations for decision making at Board level.\nKnowledge and understanding of the automotive industry.\nUnderstanding of the product emergence process (PEP) and change management processes.\nHigh level of attention to detail and project management skills.\nSound understanding of business processes.\nStrong leadership qualities and the ability to lead and motivate cross-divisional teams under pressure.\nThe ability to analyse and solve complex problems.\nGood interpersonal skills (negotiation and communication)\nMicrosoft Office (MS Excel/ MS PowerPoint/ MS Word) - Advanced\nExcellent communication and presentation skills to multinational groups\n\nAdded Advantage\nA formal qualification in project management.\nMarketing experience.\nGerman and Portuguese language proficiency.\n\nAt Volkswagen, we value an inclusive and diverse culture. We offer a trustworthy environment because we live up to our corporate values, Respect/Integrity/Excellence/One Team. Applications must be submitted via the online system by no later than Tuesday, 16th July 2024 .  All queries can be raised with Bahieya Dolley , Ext 4565 or e-mail ssf.recruitment.vwsa.r.uit@vwsa.co.za\n \nJob ID:  8418\nCompany:  Volkswagen Group South Africa (Pty) Ltd\nLocation:  ZA\nDepartment:  Other\nCareer Level:  Professionals\nShift:  Full-time\nContract type:  Unlimited\nRemote Working:  Up to 40%\nPosting Date:  8 Jul 2024\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer :\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address ssf.recuitment@vwsa.co.za\nMore information: Volkswagen South Africa\n \nAPPLY NOW »", "INTERNAL COMMUNICATIONS & EMPLOYEE ENGAGEMENT OFFICER\n \nThe future of mobility is changing. What do we contribute to this? Volkswagen produces vehicles in 14 countries and delivers them to customers in more than 150 markets worldwide. Electromobility, smart mobility and digital transformation are our core topics for the future. For many millions of people, Volkswagen is the epitome of mobility- not only today, but also tomorrow. Become part of it and help develop new solutions with your curiosity and ideas. You can expect a diverse team that supports you and with whom you can grow together and develop your potential.\nApplications are invited from suitably qualified & experienced candidates to fill the Internal Communications & Employee Engagement Officer position in the Communications Department – Kariega\n \nBrief Role Description\nTo support the execution of the Internal communication and Employee Engagement Strategy, effectively engage and inform internal stakeholders. This means providing support on internal communication initiatives, campaigns and events\n \nPossible Tasks within this Role\nParticipate as part of internal communications team in the planning of the Internal Communications and Employee Engagement strategy in line with the overarching business goals.\nSupport the development and implementation of internal communications strategy and roadmap for internal communication, aligned to the company’s vision, culture and strategy.\nCreate segmented and personalized communication through internal profiling and segmentation techniques, targeted/preferred channels, content toolkits, use of internal channels.\nFormulate and implement concepts and ideas for creative campaigns for internal audience.\nAssist in developing internal feedback mechanisms and channels to improve internal communications effectiveness and enhance employee engagement.\nPlan and conduct internal communication research and analysis of employees perceptions and benchmark on internal campaigns and measure success of campaigns.\nProvide communication guidelines and advice to key internal stakeholders ensuring effective communication initiatives are realized and leverage in line with business strategic objectives.\nSupport implementation of internal communications projects across the company, in conjunction internal business partners.\nEnsure alignment and consistency in communication and messaging together with Corporate Communications and Brand Marketing team.\nProvide input into the forecasting, planning, development and review of the budget\n \nQualification requirements\nNational Diploma / Bachelor’s Degree in Communication/ Journalism / Marketing\n \nExperience needed\nMinimum 5-7 years ‘experience in Communications/ Internal Communications/Employee Engagement /Public Relations\n \nEssentials\nTrack record of conceptualization and delivery of internal campaigns and employee events\nGood understanding of the motor or related industry\nAdvanced knowledge of MS Office (Presentation, Word, Excel)\nExcellent presentation skills\nGood interpersonal skills with the ability to communicate with all levels internally & externally\nExcellent decision-making, problem-solving skills and analytical ability\nNegotiation skills and budget management\nCreative and innovative\nProject Management\nAbility to network and work in diverse groups\n \nAt Volkswagen, we value an inclusive and diverse culture. We offer a trustworthy environment because we live up to our corporate values, Respect/Integrity/Excellence/One Team. Applications must be submitted via the online system by no later than Tuesday, 16th July 2024. All queries can be raised with Bahieya Dolley, Ext 4565 or e-mail ssf.recruitment.vwsa.r.uit@vwsa.co.za\n \nJob ID:  8530\nCompany:  Volkswagen Group South Africa (Pty) Ltd\nLocation:  ZA\nDepartment:  Communication and PR\nCareer Level:  Professionals\nShift:  Full-time\nContract type:  Unlimited\nRemote Working:  Up to 40%\nPosting Date:  8 Jul 2024\nVolkswagen Group South Africa\n \nAre you in?\nWe are looking for new talent, employees who want to achieve, believe in innovative power of ideas, leaders who are able to collaborate and adapt to the mobility of the future, take ownership, responsibility, accountability and diverse thinkers in order to embrace our differences.\n \nWhat we offer :\nCompetitive packages\nBenefits\nFlexible Working model\nCommunity Support\nEmployee Value Proposition\n \nRecruitment Address ssf.recuitment@vwsa.co.za\n \nMore information: Volkswagen South Africa\n \nAPPLY NOW »"], "postedDate": "15/7/2024", "iframe": "", "uuid": "p3f534e2f-083c-461e-a8c0-7e9a4696b580"}, {"imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/gold-fields-logo-svg.png?1716762063", "href": "https://www.govpage.co.za/private-sector-jobs/gold-fields-is-hiring", "title": "GOLD FIELDS IS HIRING", "content": [" \n \nSUPERVISOR COMMODITY CONTRACTING\nLocation:  South Deep, South Africa, 1780\nCompany:  Gold Fields Group Services (Pty) Ltd\nJob Req ID: \n \nFarm Modderfontein,\nOld Vereeniging Road,\nWestonaria, 1779\nPO Box 57,\nWestonaria, 1780\nSouth Africa\nTel +27 11 411 1000\nDir +27 11 411 1797\nFax +27 11 411 1588 www.goldfields.com\n \nSouth Deep is recruiting!\n \nThis is an opportunity to bring your expertise to a dynamic and engaged team of professionals, working together to become the beacon of pride for our people, our communities, our stakeholders, and our shareholders.\n\n \nAt South Deep, we value each person’s individual and collective contribution and support your ongoing development, helping you to achieve your career and our business aspirations.\n \nPOSITION: Supervisor Commodity Contracting\nJOB GRADING: C-Upper\nDEPARTMENT: Commercial Services\nSITE: South Deep Gold Mine\n \nThe Supervisor Commodity Contracting is accountable for maintaining requisite commodity sourcing as directed and to maintain the related sourcing contracts to the required operational specifications and governance standards, whilst maintaining effective stakeholder relationships.\n \nMinimum Requirements:\nGrade 12 qualification or equivalent\nRelevant tertiary qualification\nAt least 5 years’ procurement experience of which 3 years must have been within a mining environment\nAt least 2 years’ experience in a supervisory position\nComputer literate with a working knowledge of Microsoft Office packages\nBe declared medically fit for the position and environment, as determined by a risk-based medical examination at the Gold Fields Occupational Health Centre and pass a Heat Tolerance Screening test, and such other tests as may be required to assess the applicant’s suitability for employment\n \nKey Competencies:\nProven safety leadership track record\nProven track record in effective negotiating and contracting skills\nWorking knowledge of commercial processes and application of best practices within tender and contracting compliance and management\nSound interpersonal skills with the ability to build and maintain strong business relationships through ongoing engagement and collaboration\nProven diagnostic, problem-solving and decision-making skills\nStrong planning, prioritisation, and organisational skills\nDisplay a high level of motivation and has a strong work ethic\nDisplay a high level of attention to detail and ensures accuracy in work\nAble to handle conflict, work under pressure and manage time effectively\n \nDuties and Responsibilities:\nDemonstrate behaviour in line with health, safety and environmental standards\nEnable efficient service delivery to Gold Field’s internal and external stakeholders\nIdentify and secure balanced price and quality procurement opportunities and ensure the continuity and security of supply\nManage and coordinate direct procurement requirements and execute in accordance with Gold Fields’ policies and procedures\nManage contract suppliers/vendors in accordance with agreed SLAs ensuring optimised delivery to the business\nCoordinate commercial processes, including tenders, contract negotiations, scope changes, price adjustments and related contract administration requests\nDevelop and maintain effective relationships with internal and external stakeholders\nParticipate in the audit of procurement process and remedy findings to ensure best practice and mitigate risk\n \n \nClosing Date: 30 May 2024\n                            \nPlease note that the Gold Fields code of conduct strictly prohibits the exchange of any payment as part of its recruitment process.\n \n Should you require any assistance or have any challenges in applying for a position, please contact the Recruitment hub on 011 411 1387\n \nGold Fields is committed to the achievement and maintenance of diversity and equity in employment\n \nNOTE: all relevant certificates must be attached to your CV in order to be considered for shortlisting\n \n*South Deep Joint Venture is an unincorporated joint venture between GFI Joint Venture Holdings Proprietary Limited (Reg. No. 1998/023354/07) and Gold Fields Operations Limited (Reg. No. 1959/003209/06), both wholly-owned subsidiaries of Newshelf 899 Proprietary Limited (Reg. No. 2007/019941/07) a subsidiary of Gold Fields Limited (Reg. No. 1968/004880/06).\n \nGold Fields Operations Limited Directors: MJ Fraser (Chairman), NA Chohan, J Magagula, P Matete, BL Mokoatle\nGFI Joint Venture Holdings Proprietary Limited Directors: MJ Fraser (Chairman), NA Chohan, J Magagula, P Matete, BL Mokoatle\nCompany Secretary: Gold Fields Group Services (Proprietary) Ltd\n \nAPPLY NOW »\n \n \n \n \n ", "SUPERVISOR COMMODITY CONTRACTING\nLocation:  South Deep, South Africa, 1780\nCompany:  Gold Fields Group Services (Pty) Ltd\nJob Req ID: \n \nFarm Modderfontein,\nOld Vereeniging Road,\nWestonaria, 1779\nPO Box 57,\nWestonaria, 1780\nSouth Africa\nTel +27 11 411 1000\nDir +27 11 411 1797\nFax +27 11 411 1588 www.goldfields.com\n \nSouth Deep is recruiting!\n \nThis is an opportunity to bring your expertise to a dynamic and engaged team of professionals, working together to become the beacon of pride for our people, our communities, our stakeholders, and our shareholders.\n \nAt South Deep, we value each person’s individual and collective contribution and support your ongoing development, helping you to achieve your career and our business aspirations.\n \nPOSITION: Supervisor Commodity Contracting\nJOB GRADING: C-Upper\nDEPARTMENT: Commercial Services\nSITE: South Deep Gold Mine\n \nThe Supervisor Commodity Contracting is accountable for maintaining requisite commodity sourcing as directed and to maintain the related sourcing contracts to the required operational specifications and governance standards, whilst maintaining effective stakeholder relationships.\n \nMinimum Requirements:\nGrade 12 qualification or equivalent\nRelevant tertiary qualification\nAt least 5 years’ procurement experience of which 3 years must have been within a mining environment\nAt least 2 years’ experience in a supervisory position\nComputer literate with a working knowledge of Microsoft Office packages\nBe declared medically fit for the position and environment, as determined by a risk-based medical examination at the Gold Fields Occupational Health Centre and pass a Heat Tolerance Screening test, and such other tests as may be required to assess the applicant’s suitability for employment\n \nKey Competencies:\nProven safety leadership track record\nProven track record in effective negotiating and contracting skills\nWorking knowledge of commercial processes and application of best practices within tender and contracting compliance and management\nSound interpersonal skills with the ability to build and maintain strong business relationships through ongoing engagement and collaboration\nProven diagnostic, problem-solving and decision-making skills\nStrong planning, prioritisation, and organisational skills\nDisplay a high level of motivation and has a strong work ethic\nDisplay a high level of attention to detail and ensures accuracy in work\nAble to handle conflict, work under pressure and manage time effectively\n \nDuties and Responsibilities:\nDemonstrate behaviour in line with health, safety and environmental standards\nEnable efficient service delivery to Gold Field’s internal and external stakeholders\nIdentify and secure balanced price and quality procurement opportunities and ensure the continuity and security of supply\nManage and coordinate direct procurement requirements and execute in accordance with Gold Fields’ policies and procedures\nManage contract suppliers/vendors in accordance with agreed SLAs ensuring optimised delivery to the business\nCoordinate commercial processes, including tenders, contract negotiations, scope changes, price adjustments and related contract administration requests\nDevelop and maintain effective relationships with internal and external stakeholders\nParticipate in the audit of procurement process and remedy findings to ensure best practice and mitigate risk\n \n \nClosing Date: 30 May 2024\n                            \nPlease note that the Gold Fields code of conduct strictly prohibits the exchange of any payment as part of its recruitment process.\n \n Should you require any assistance or have any challenges in applying for a position, please contact the Recruitment hub on 011 411 1387\n \nGold Fields is committed to the achievement and maintenance of diversity and equity in employment\n \nNOTE: all relevant certificates must be attached to your CV in order to be considered for shortlisting\n \n*South Deep Joint Venture is an unincorporated joint venture between GFI Joint Venture Holdings Proprietary Limited (Reg. No. 1998/023354/07) and Gold Fields Operations Limited (Reg. No. 1959/003209/06), both wholly-owned subsidiaries of Newshelf 899 Proprietary Limited (Reg. No. 2007/019941/07) a subsidiary of Gold Fields Limited (Reg. No. 1968/004880/06).\n \nGold Fields Operations Limited Directors: MJ Fraser (Chairman), NA Chohan, J Magagula, P Matete, BL Mokoatle\nGFI Joint Venture Holdings Proprietary Limited Directors: MJ Fraser (Chairman), NA Chohan, J Magagula, P Matete, BL Mokoatle\nCompany Secretary: Gold Fields Group Services (Proprietary) Ltd\n \nAPPLY NOW »", "SUPERVISOR ENGINEERING ELECTRICIAN UG\nLocation:   Westonaria, South Deep, South Africa, 1780\nCompany:  Gold Fields Group Services (Pty) Ltd\nJob Req ID: \n \nFarm Modderfontein,\nOld Vereeniging Road,\nWestonaria, 1779\nPO Box 57,\nWestonaria, 1780\nSouth Africa\nTel +27 11 411 1000\nDir +27 11 411 1797\nFax +27 11 411 1588 www.goldfields.com\n \nSouth Deep is recruiting!\n \nThis is an opportunity to bring your expertise to a dynamic and engaged team of professionals, working together to become the beacon of pride for our people, our communities, our stakeholders, and our shareholders.\n \nAt South Deep, we value each person’s individual and collective contribution and support your ongoing development, helping you to achieve your career and our business aspirations.\n \nPOSITION: Supervisor Engineering Electrician\nJOB GRADING: C-Upper\nDEPARTMENT: Engineering - Infrastructure\nSITE: South Deep Gold Mine\n \nThe Supervisor Engineering Electrical assumes accountability for the overall safe and efficient operation of the electrical section covering the shaft electrical reticulation, conveyor belt systems and solar plant.  The role leads and controls the electrical operations in accordance with safety standards and procedures to ensure the elimination of production delays and safety risks to personnel.  A core accountability of the role is to maintain the highest possible safety standards in the area of operation and influence\n \nMinimum Requirements:\nGrade 12 or equivalent\nRelevant Recognised Trade Certificate\nMinimum of 5 years’ experience as an Electrician in underground mining, shaft conveyor and reticulation systems\nRecognized approved Medium Voltage Certificate\nBe declared medically fit for the position and environment, as determined by a risk-based medical examination at the Gold Fields Occupational Health Centre and pass a Heat Tolerance Screening test, and such other tests as may be required to assess the applicant’s suitability for employment\n \nKey Competencies:\nIntermediate operational safety experience with sound appreciation for safety standards and record management\nGood communication, interpersonal and team leadership skills\nKnowledge of relevant mining legislation, with emphasis on Electrical Regulations\nProven organisation skills - planning, organising, leading, and controlling \nProven proficiency in technical problem solving\nProven track record in maintaining LT and HT reticulation systems, surface and underground substations, underground and surface conveyor belt systems and spillage winch arrangements sections\nComputer literacy with basic MS Office proficiency\nWorking knowledge of SAP\nAbility to manage, control and input into the financial budget of the responsible section\n \nDuties and Responsibilities:\nEnsure implementation and adherence to the Mine Health & Safety Act and Environmental COPs, policies, procedures and legal requirements within the area of responsibility\nMaintain and manage health and safety policies, standards, and procedure for section and area of responsibility\nConvene and participate in sectional health and safety meetings, forums, and campaigns\nManage operational risk with the section or area of responsibility and evaluate and monitor compliance to codes of practice\nAccountable for legal compliance as the Regulation 2.9.2 appointee for the area of responsibility\nManage key performance areas of subordinates and ensure subordinates are adequately trained to perform their duties\nPlan and execute maintenance and repair activities safely and timeously and ensure daily, weekly, monthly, and annual maintenance targets are met\nManage electrical construction or maintenance work\nEnsure ordering of equipment and availability of critical spares\nConduct formal Root Cause Failure Analysis (RCFA) to ensure equipment reliability\nManage and control spares inventory including the placing and follow-up of orders\nInput into, formulate and manage annual budgets for the section\nPerform all duties relevant to the position, including standby, overtime and call-outs\n \n \nClosing Date: 27 May 2024\n                            \nPlease note that the Gold Fields code of conduct strictly prohibits the exchange of any payment as part of its recruitment process.\n \n Should you require any assistance or have any challenges in applying for a position, please contact the Recruitment hub on 011 411 1387\n \nGold Fields is committed to the achievement and maintenance of diversity and equity in employment\n \nNOTE: all relevant certificates must be attached to your CV in order to be considered for shortlisting\n \n*South Deep Joint Venture is an unincorporated joint venture between GFI Joint Venture Holdings Proprietary Limited (Reg. No. 1998/023354/07) and Gold Fields Operations Limited (Reg. No. 1959/003209/06), both wholly-owned subsidiaries of Newshelf 899 Proprietary Limited (Reg. No. 2007/019941/07) a subsidiary of Gold Fields Limited (Reg. No. 1968/004880/06).\n \nGold Fields Operations Limited Directors: MJ Fraser (Chairman), NA Chohan, J Magagula, P Matete, BL Mokoatle\nGFI Joint Venture Holdings Proprietary Limited Directors: MJ Fraser (Chairman), NA Chohan, J Magagula, P Matete, BL Mokoatle\nCompany Secretary: Gold Fields Group Services (Proprietary) Ltd\n \nAPPLY NOW »"], "postedDate": "27/5/2024", "iframe": "", "uuid": "pee79f0cc-af66-4c66-98e9-4f47291bef56"}, {"imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/glencore_orig.jpg", "href": "https://www.govpage.co.za/private-sector-jobs/glencore-is-hiring5185584", "title": "GLENCORE IS HIRING", "content": [" \n \nSUPERINTENDENT-PROJECT CONTROL (M/F) \n \nJob highlights\nKolwezi, Lualaba, République Démocratique du Congo\nKolwezi, Lualaba, République Démocratique du Congo\nJob ID05O - 001126/24\nClosing date 03/06/2024\n \nAPPLY\n \nINTERNAL/EXTERNAL RECRUITMENT NOTICE N° 18/RRL000185/MUMI/2024\n\n\nMUMI is currently looking to recruit a: \" Superintendent-Project Control (M/F) \" \n\n1.      Number of vacancies: 1\n2.     Position Level: Executive\n3.     Type of contract: Permanent contract\n4.     Deadline for applications: 02 June 2024\n\nMain objectives of the position\nUnder the direct supervision of the Head of Department - Engineering Projects, the incumbent of this position will provide considerable support to various achievements at MUMI. He/She will have to demonstrate operational and practical experience in the field.\nMinimum Qualifications \n·     A degree in mining engineering, geosciences, metallurgy, chemical engineering, certification in supply chain, project management or a similar field,\n·     A Professional Project Management (PMP) certificate, and\n·     A certificate in the capital project management system.\nRequired Experience\n·     A perfect command of French and English, and\n·     Project management.\n·     A minimum of 5 years of experience in the mining sector.\n\nRequired skills\n·     Proven experience in the use of the Capital Project Management System (CMF).\n\nKey Responsibilities\n·     Ensure that training plans within the project department, competency matrices and staff training schedule are available,\n·     Integrate the results of the capital budget assessment into the capital project management system and submit them for approval so that the project schedule and cost forecast align with the asset useful life (LOA);\n·     Report any identified issues related to project timelines,\n·     Manage the project in progress each in the absence of the project manager,\n·     Establish, maintain, and monitor the progress of projects in accordance with Glencore's budget, schedule, and CMF policy, and\n·     Comply with Glencore's environmental management requirements and procedures as well as MUMI SARL's environmental policy.\n\nChallenges\n·     Constraint to the completion of the project on budget and on schedule\n\nGo to the following website:\n\n§  Rendez-vous au site web suivant : https://www.glencore.cd/fr/mutandamining/job-opportunities\nou scannez le QR Code ci-après :\n§  Entrez votre identifiant et mot de passe pour accéder à votre interface candidat sur notre site des carrières.\n§  Si vous ne disposez pas encore d’un compte, veuillez en créer au préalable et bien conserver votre identifiant et mot de passe pour usage future.\n§  Télécharger les documents ci-après : la copie de la carte d’identité, la lettre de demande d’emploi, le Curriculum Vitae (CV en Français et en Anglais), la carte ONEM, l’attestation de bonne vie et mœurs, la copie du casier judiciaire, les attestations des services rendus, et les copies des diplômes obtenus.\n§  Signaler toutes difficultés d’ordre technique, à l’adresse suivante : application.queries@mutandamining.com\n             \nN.B: \nOnly applications that meet the required criteria will be considered. \nApplications not contacted two weeks after the closing of this recruitment notice should be considered as not having been selected.\nRecords received will be kept in the Company's database for a period of six (6) months in complete confidentiality.\nBy sending your Curriculum Vitae, you give permission to MUMI SARL to share your information with the participants in the selection process for this position only; and checks of your academic and/or professional background, as well as your references may be undertaken.\n\nIMPORTANT:\nMUMI SARL does not accept applications submitted by persons under the age of eighteen (18). \nIn accordance with Article 1 of the Labor Code of the Democratic Republic of Congo, MUMI SARL receives all applications without distinction or discrimination. \nHowever, as part of its equal opportunity, diversity, equity, and inclusion agenda, female applications are strongly encouraged.\nIn accordance with our Compliance Policy and Code of Conduct, MUMI SARL or its employees do not receive any remuneration or benefits of any kind at any stage of the recruitment process. Violators are subject to legal action.\n\nAny act of bribery or attempted bribery must be immediately reported to the telephone number: +243 99 99 28 028 and will be severely punished.\n\nApply\n \n \n \n ", " \n \n \n \n \nSAFECOAL MANAGER\n \nJob highlights\nGlencore Coal SA\nWitbank, Mpumalanga, South Africa\nGroup Services\nJob ID GRS MM 2024/06\nClosing date 30/05/2024\n \nAPPLY\n \nSafeCoal Manager\nGroup Services, Glencore Coal SA\n\nGlencore is one of the world’s largest global diversified natural resource companies. Our global network comprises more than 90 offices located in over 50 countries, with over 150 mining and metallurgical sites, offshore oil production assets, farms and agricultural facilities. Our strategy is to maintain and build upon our position as a leading integrated producer and marketer of commodities worldwide. We employ over 150,000 employees and contractors, who collectively work to deliver our strategy and support our values of safety, integrity, responsibility, openness, simplicity and entrepreneurialism. Its these people that we value above all else. They are our greatest asset.\n\nJoin us and let’s grow together.\nWe are currently accepting applications for the following position located in the Witbank, Mpumalanga area.\n\nThe successful candidate will be responsible for developing and reviewing risk management processes and the identification of appropriate controls to manage Health and Safety related risks.\n \nKey Responsibilities:\nFacilitating Risk Assessments and Critical Task Identification and Analysis (CTA).\nManaging Catastrophic Hazards and Critical Controls.\nDeveloping, reviewing and maintaining Risk Management Procedures.\nConducting Risk Management Training.\nParticipating in Risk Based Audits within the Company.\nDeveloping a Behavioural Based Safety Programme for the Company.\nLeading or conducting internal audits at the Complexes.\nContributing to the development of new tools, reports and standards to enhance Health and Safety in the workplace.\nPromoting Health and Safety awareness within the Company.\n \n Minimum Qualifications:\nA relevant degree or equivalent qualification in Health/Safety/Mining/Engineering.\n \nMinimum Experience:\n2 Years’ experience at a Superintendent level.\nUnderstanding of Risk Management, ISO 3100.\nKnowledge of Assurance and Verification Processes.\n \nBehavioural Competencies:\nAbility to adhere to rules and regulations, follow instructions and limit risk of non-compliance to the business.\nAbility to maintain high levels of individual and team performance by driving the achievement of goals, targets and financial objectives.\nAbility to inspire and foster commitment, pride and trust amongst team members by taking a democratic approach, seeking and valuing contributions and encouraging collaboration.\nAbility to carefully and objectively analyse and evaluate information to inform decisions and key actions.\n \nAPPLY\n \n \n \n ", " \n \n \n \nPROCUREMENT MANAGER\n \nJob highlights\nGlencore Coal SA\nWitbank, Mpumalanga, South Africa\nGroup Services\nJob IDGRS MM 2024/08\nClosing date30/05/2024\n \nAPPLY\n \nProcurement Manager\nGroup Services, Glencore Coal SA\n\nGlencore is one of the world’s largest global diversified natural resource companies. Our global network comprises more than 90 offices located in over 50 countries, with over 150 mining and metallurgical sites, offshore oil production assets, farms and agricultural facilities. Our strategy is to maintain and build upon our position as a leading integrated producer and marketer of commodities worldwide. We employ over 150,000 employees and contractors, who collectively work to deliver our strategy and support our values of safety, integrity, responsibility, openness, simplicity and entrepreneurialism. Its these people that we value above all else. They are our greatest asset.\n\nJoin us and let’s grow together.\nWe are currently accepting applications for the following position located in the Witbank, Mpumalanga area.\n\nThe succesful candidate will be responsible for managing the Purchasing and Enterprise and Supplier Development Strategies for the Company to minimise risk, drive value and control cost.\n \nKey Responsibilities\nAssisting in developing and implementing the Purchasing and ESD strategies.\nEvaluating suppliers to achieve the lowest price for high-quality goods.\nMonitoring and forecasting inventory, determining purchasing needs.\nManaging on site ESD service providers and business hubs.\nSelecting and negotiating with approved vendors and placing purchase orders in response to product, materials, services, and supply requirements\nEvaluating quality, price, reliability, technical support and availability of goods and services.\nEnsuring compliance to the relevant Policies, Procedures and Legislation.\n \nMinimum Qualifications:\nRelevant tertiary qualification.\n \nMinimum Experience:\nMinimum 3 years’ experience in procurement.\nEnterprise Resource Planning System (SAP/COUPA) experience.\nEnterprise and Supplier Development experience.\nProcurement Principles and Standards, knowledge and experience.\nMining experience will be advantageous.\nExperience with analytical tools.\n \nBehavioural Competencies:\nAbility to treat diverse groups of people with respect and effectively employing diversity to the advantage of the organisation.\nAbility to encourage and develop others to pro- actively build talent capacity and create opportunities to address current and future development needs.\nAbility to inspire and foster commitment, pride and trust amongst team members by taking a democratic approach, seeking and valuing contributions and encouraging collaboration.\nAbility to maintain high levels of individual and team performance by driving the achievement of goals, s and financial objectives.\n \nAPPLY\n \n \n \n ", " \n \n \n \nENABLEMENT MANAGER\n \nJob highlights\nGlencore Coal SA\nWitbank, Mpumalanga, South Africa\nGroup Services\nJob IDGRS MM 2024/07\nClosing date30/05/2024\n \nAPPLY\n \nEnablement Manager\nGroup Services, Glencore Coal SA\n\nGlencore is one of the world’s largest global diversified natural resource companies. Our global network comprises more than 90 offices located in over 50 countries, with over 150 mining and metallurgical sites, offshore oil production assets, farms and agricultural facilities. Our strategy is to maintain and build upon our position as a leading integrated producer and marketer of commodities worldwide. We employ over 150,000 employees and contractors, who collectively work to deliver our strategy and support our values of safety, integrity, responsibility, openness, simplicity and entrepreneurialism. Its these people that we value above all else. They are our greatest asset.\n\nJoin us and let’s grow together.\n\nWe are currently accepting applications for the following position located in the Witbank, Mpumalanga area.\n\nThe successful candidate will be responsible for evaluating business processes, identifying potential improvement areas, and developing optimization strategies for the Supply Chain Department.\n \n Key Responsibilities\nEnhancing decision making by development and deployment of insightful dashboards, reporting, and analytics tools to improve supply chain productivity.\nTaking responsibility for communication, training and implementation of the defined business processes.\nManaging the tracking of department Service Level Agreements and Key Performance Indicators.\nProviding market insight support for sourcing strategies.\nConducting supply chain analytics to drive business decisions.\nEnsuring compliance to the relevant Policies, Procedures and Legislation.\n \nMinimum Qualifications:\nRelevant tertiary qualification.\n \nMinimum Experience:\nMinimum 3 years’ experience in commercial/supply chain.\nEnterprise Resource Planning System (SAP/COUPA) experience.\nProcurement and Sourcing Principles and Standards, knowledge and experience.\nMining experience will be advantageous.\nExperience with analytical tools.\n \nBehavioural Competencies:\nAbility to treat diverse groups of people with respect and effectively employing diversity to the advantage of the organisation.\nAbility to encourage and develop others to pro- actively build talent capacity and create opportunities to address current and future development needs.\nAbility to inspire and foster commitment, pride and trust amongst team members by taking a democratic approach, seeking and valuing contributions and encouraging collaboration.\nAbility to maintain high levels of individual and team performance by driving the achievement of goals, s and financial objectives.\n \nAPPLY\n \n \n \n ", " \n \n \n \nBUYER (STORES) STOCK\n \nJob highlights\nLion Smelter Steelpoort\nSteelpoort, Limpopo, South Africa\nJob IDLIOHR238\nClosing date28/05/2024\n \nAPPLY\n \nQUALIFICATIONS\n•    Grade 12  \n\n\nSKILLS REQUIREMENTS\n•    A minimum of 3 years buying experience within a mining/manufacturing environment \n•    Must have basic technical knowledge.\n•    High-level computer skills / full Microsoft Office packages\n•    Strong interpersonal skills to work with team members and suppliers\n•    Negotiation skills to work with suppliers and make better deals for the company\n•    SAP knowledge essential\n•    An understanding of purchase order software platforms i.e. COUPA\n•    Able to demonstrate continuous improvement through purchasing processes\n•    Optimal time management and organisational skills with the ability to work to strict deadlines and under pressure\n•    Good attention to detail \n•    Math skills to make sure all calculations are correct and avoid any unforeseen losses for the company \n•    Computer literate – MS – Office\n\nJOB OBJECTIVES\nIn this role you will be responsible to the Controller (Stores) for the following:\n•    Sourcing and procurement of stock items to the correct specifications at the best quality and price.\n•    Ensure out of stock situations are addressed and corrected with the necessary urgency.\n•    To ensure HSEC rules and regulations are adhered to and that a sustainable environment is assured.\n•    To liaise and communicate with relevant external and internal stakeholders to ensure timeous delivery and supply of goods and services.\n•    Maintain regular communication with the Production and Maintenance Teams to finalise and confirm the weekly production/shutdown schedules based on plant requirements and available material stocks.\n•    Supply adequate cost-effective procurement solutions.\n•    Conduct market research and report on movements in price and changes in terms being offered.\n•    Expedite all orders within required limits.\n•    Manage supplier relationships including quality and supply issues, improving supplier performance and building successful supply chain partnerships\n•    Identify and assess new supply options for current and upcoming purchasing requirements and ensure goods and services are SABS & HSEC compliant.\n•    Ensure BEE policies are complied with.\n•    Adhere to P2P and other related policies and procedures.\n•    Complete the internal vendor approval process to ensure that all vendors meet the relevant business standards and all relevant certification and records are up to date.\n•    Successfully manage a large supplier base; negotiating improved supplier terms and pricing.\n•    In conjunction with the Stores Controller and the Stores Superintendent, arrange and attend supplier meetings in order to analyse and discuss supplier performance, as well as gain knowledge of the full portfolio of products and services offered\n•    Ensure good housekeeping in procurement.\n•    The employee will at all times adhere the company rules, standing instructions, policies and Procedures.\n•    Analyse internal purchasing processes and suggest improvements to ensure continuity of the department’s performance.\n \nAPPLY\n \n \n \n \n ", "PRODUCTION SUPERVISOR\n \nJob highlights\nGlencore Coal SA\neMalahleni, Mpumalanga, South Africa\nGoedgevonden Complex\nJob IDGGV 2024/005\nClosing date27/05/2024\n \nAPPLY\n \nProduction Supervisor \nGoedgevonden Complex, Opencast Operations\n\nGlencore is one of the world’s largest global diversified natural resource companies. Our global network comprises more than 90 offices located in over 50 countries, with over 150 mining and metallurgical sites, offshore oil production assets, farms and agricultural facilities. Our strategy is to maintain and build upon our position as a leading integrated producer and marketer of commodities worldwide. We employ over 150,000 employees and contractors, who collectively work to deliver our strategy and support our values of safety, integrity, responsibility, openness, simplicity and entrepreneurialism. Its these people that we value above all else. They are our greatest asset.\n\nJoin us and let’s grow together.\nWe are currently accepting applications for the following position located in the Witbank, Mpumalanga area.\nReporting to the Production Superintendent, Goedgevonden Complex, the successful candidate will be responsible for ensuring that production targets are met in accordance with all relevant standards, policies and procedures in areas of responsibility, through optimal utilization of people and equipment.\n \nIn this role you will be responsible for:\nCreating an understanding of daily and weekly production targets amongst team members to make sure targets are achieved and executed safely.\nReviewing shift performance on an ongoing basis and discussing progress against agreed deliverables, deadlines and provides support required by team members.\nIdentifying continuous improvement opportunities to use people, equipment, processes and reports in the daily meetings for consideration in the planning effort.\nCreating an understanding of company policy and procedures, including legislative requirements among team members and ensures compliance.\n \nMinimum Qualifications\nGrade 12 and an Opencast Blasting Certificate for Coal Mines; OR\nA relevant degree and an Opencast Blasting Certificate for Coal Mines.\n2 different types of Opencast Machine Licenses.\nDriver’s License (Code EB/08).\n \nMinimum Experience\n2 Years’ experience as a Digger/Dragline Operator or Blaster or completed Graduate Development Programme.\n \nBehaviour Competencies:\nCreating an understanding of daily and weekly production targets amongst team members to make sure targets are achieved and executed safety.\nReviewing shift performance on an ongoing basis and discussing progress against agreed deliverables, deadlines and provides support required by team members.\nIdentifying continuous improvement opportunities to use people, equipment, processes and reports in the daily meetings for consideration in the planning effort.\nCreating an understanding of company policy and procedures, including legislative requirements among team members and ensures compliance.\n \nWhat we offer:\nA workplace culture that encompasses safety, integrity, responsibility, openness, simplicity and entrepreneurialism.\nEmployee Wellness and Financial Programs.\nProfessional growth opportunities.\n \nPriority will be given to candidates residing in the local communities where Glencore Coal Operations South Africa are located (Nkangala District of the Mpumalanga province).\nGlencore is an equal opportunity employer and is committed to creating and maintaining a diverse and inclusive workforce.\n \nAPPLY", " \nFINANCE OPERATIONS ANALYST\n \nJob highlights\nGlencore Holdings South Africa\nJohannesburg, Gauteng, South Africa\nFinance Operations\nJob IDHRR0001022/23\nClosing date25/05/2024\n \nAPPLY\n\n\nThe purpose of this role is to support the Marketing Finance team in Baar and Johannesburg We are looking for a motivated and eager candidate with a keen interest in the commodity trading environment where you will be responsible for: invoicing, collection and settlement and relevant projects.\n\nWe are looking for someone with a keen interest in business process automation, internal control, efficiency, and improvement.\n\n\nKEY RELATIONSHIPS:\nFinance Marketing department in Baar and Johannesburg\nFinance Back Office team.\nMarketing and Logistics team in Baar and Johannesburg\n\nQUALIFICATION & SKILL REQUIREMENTS:\n\nMinimum Qualifications:\nBachelor’s Degree in Accounting/Finance.\n\nAdditional Qualifications:\nAdvantageous to demonstrate post qualification studies or soft skills development.\n\nCompetencies:\nStrong verbal and written communication skills that work effectively within team and different audiences.\nAdaptable, dynamic, and organised with a positive and enthusiastic attitude\nInteracts well within a team and actively manage expectations.\nTake initiative in resolving issues in a structured methodical manner.\nHave a strong sense of responsibility and ownership.\nHigh level of attention detail, in a fast-moving environment.\nDeliverable and service orientated.\nPro- active, accountable, and self- motivated.\nNeed to be adaptable, flexible, and entrepreneurial.\nAdvanced knowledge of MS Office tools, especially Excel.\nAdvanced English language ability, both written and spoken.\n\nWork Experience:\n3 to 5 years relevant experience including experience of commodity trading invoicing and settlement or accounts payable.\nWorking knowledge of commodity trading systems and invoicing to ERP integration\n\nGeneral Accountability:\nValidate provisional/final invoices submitted by the front office operations team against deal and the supporting documents. Book invoices in commodity trading system and submit for payment.\nCapture secondary cost invoices received and submit for payment.\nFollow up on un-invoiced deliveries or services.\nReport on overdue invoices.\nStore and archive invoices and invoice data together with commodity deal data.\nNet/offset invoices where possible prior to settlement and communicate netting and offsetting with counterparties, in collaboration with the front office operations team.\nPrepare invoices for settlement.\nFollow up on settlement execution.\nFollow up on invoice/settlement counterparty queries.\nSupport Treasury Operations in resolving unapplied cash queries.\nMatch and clear open invoices in the invoicing system.\nAutomate financial operations activities to ensure straight through processing to the general ledger.\nIn collaboration with other financial operations teams, identify and implement financial operations best practice including processes and internal controls.\n\n\n\nHow to apply:\n\nPlease apply on the Careers Portal: https://www.glencore.com/careers/career-opportunities       \n\n\nThis vacancy will be filled in line with the Employment Equity Plan of Glencore. By applying for this position, you consent to Glencore collecting, storing, using, destroying, and processing in any other manner personal information for purposes of attending to this advertisement, and/ or all matters relating thereto, including the disclosure to third parties of such personal information for purposes of confirming such personal information. In the event you do not hear from the Company within 21 days after the closing date of applications, please consider your application to have been unsuccessful. The CVs of unsuccessful candidates will not be returned.\n\nApplications Close: 23 May 2024\n \nApply", "SHIPPING CLERK\n \nJob highlights\nGlencore Holdings South Africa\nJohannesburg, Gauteng, South Africa\nMarketing & Logistics\nJob IDHRR0001024\nClosing date24/05/2024\n \nAPPLY\n\nThis role is responsible to support the commercial logistics and traffic functions with expediting shipping and the ocean export of raw materials/commodities from Africa to customer destinations by converting manual shipping administrative systems and associated interfaces with shipping lines to online processes.\n\nGeneral Accountability:\nEstablish online shipping administration as an in-house resource to move to seamless interfaces with shipping service providers having different administrative systems through a project coordination approach, and by setting up and applying online administrative platforms and procedures.\nEnsure prompt service from service providers by forging and maintaining close relationships, by ensuring invoices are promptly paid and by resolving problems issues swiftly and effectively.\nLiaise closely with logistics management and traffic to register any problems and convey decisions to stakeholders as appropriate.\nEstablish and manage stakeholder relationships with internal stakeholders by being the first point of contact for end user shipping and related queries and needs relating to the African esports of raw materials / commodities to customer destinations.\nRespond to sales export bookings and requirements by liaising with logistics management, traffic, and shipping lines regarding freight bookings ex-Africa, and ensuring correct warehouse is advised of said bookings and special instructions to meet vessel stacks.\nPrepare bill of lading by receiving, accessing, and collating relevant data and information from sources, and forward to shipping line.\nEnsure correct freight rates are applied per rate agreement structures, and that shipping lines have appropriate equipment positioned to collect for packing.\nComply with Compliance and Sanctions guidelines regarding the Vessel Screening Procedure and the required pre-approvals to commercially engage with service providers and vessels.\nEnsure bank releases are in order by liaising with financial functions, that containers are packed with correct allocation, and are transported and stacked to meet vessel stacks to clear the path for material to be exported.\nTransfer and implement systematically and purposefully online shipping processes and administration to enhance the shipping administrative organizational environment through the application of online shipping knowledge and experience to replace manual shipping administrative procedures.\nFulfil contractual obligations by obtaining vessel certificates, warehouse receipts, arrival notifications, and any other salient documentation.\nCollect original documentation, bills of lading having ensured that documentation and payment have been surrendered to the shipping line.\nMonitor movement, departure, and arrival at port of vessels by updating information tracking systems and through close liaison with shipping line, and updates logistics management and traffic accordingly.\nProvide shipping administrative support as required, relating to shipping documentation, storage, payment and ocean freight activities and services.\n\n\nKey relationships:\nShipping Lines.\nFreight Forwarders.\nCategory Leads.\nEnd users from Sites.\n\n\nQUALIFICATION & SKILL REQUIREMENTS:\n\nMinimum Qualifications:\n\nGrade 12 / Matric.\nRelevant Diploma required.\n\nWork Experience:\n2-4 Years in shipping and freight forwarding environments, with exposure to the full range of online shipping administrative functions.\nProficient in online shipping administrative procedures.\n\nCompetencies:\nMS Office / Computer literate.\nCommunication skills (verbal, written).\nAttention to detail.\nCustomer oriented.\nResults-driven and self-motivated.\nAbility to multi-task and prioritize. \nAbility to work under pressure.\nTeam player.\n\n\n\nHow to apply:\n\nPlease apply on the Careers Portal: https://www.glencore.com/careers/career-opportunities\n\n\nThis vacancy will be filled in line with the Employment Equity Plan of Glencore. By applying for this position, you consent to Glencore collecting, storing, using, destroying, and processing in any other manner personal information for purposes of attending to this advertisement, and/ or all matters relating thereto, including the disclosure to third parties of such personal information for purposes of confirming such personal information. In the event you do not hear from the Company within 21 days after the closing date of applications, please consider your application to have been unsuccessful. The CVs of unsuccessful candidates will not be returned.\n \nApplications Close: 23 May 2024\n\n\nAPPLY"], "postedDate": "23/5/2024", "iframe": "", "uuid": "p0582e4fa-a5b5-4e64-8dd1-1d33eb4a7766"}, {"imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/de-beers-group_orig.png", "href": "https://www.govpage.co.za/private-sector-jobs/de-beers-group-is-hiring6012171", "title": "DE BEERS GROUP IS HIRING", "content": [" \n \nMRP ADVISOR\nBusiness Unit / Group Function: Technical\nDiscipline: Supply Chain\nLocation: Postmasburg, South Africa\nReference Id: REF59738R\nExperience / Work Type: Associate / Permanent Employee\nClosing Date: 04 September, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nAnglo American’s purpose is to reimagine mining to improve people’s lives and is committed to creating a Living Mine that brings positive value to the people and environment where we operate.\n\nSupply Chain is positioning itself for the future, by becoming more purpose-driven in aid of realizing the Anglo American purpose, and driving to be more agile and resilient. Central to being more purpose-driven is delivering significantly more positive impact within our host communities, acting as supplier interface to provide velocity to our innovation, technical & sustainability change programme, that includes improved safety performance and the embedment of circular economy principles, as well as overall delivery of significantly more sustainable value. To build a more agile and resilient Supply Chain the commoditized execution and digitalisation of processes is a key focus whilst driving operational excellence.\nThis Physical Supply Chain (PSC) team is responsible for managing all materials planning, inventory, warehousing and logistics across the South African region. The team works with operational stakeholders and Supply Chain commercial teams to assess future demands and develop materials strategies and plans that will fulfil needs whilst keeping working capital as low as possible.\n \nJob Description:\nThis role will support integrated planning practices with the aim of ensuring optimal parts availability through streamlined physical networks to achieve step-change performance.\nYour duties will include:\n• Identify ways to support specific safety, health & sustainability opportunities and risks and ensure that materials planning activities complies with all Safety, Health & Environmental requirements.\n• Manage the effective implementation of the Supply Chain strategy within the Physical Supply Chain and materials planning environment\n• Embrace an agile Supply Chain by being adaptive and flexible to accommodate and focus on emerging and changing business priorities\n• Implement the Materials Plan based upon inputs from end-users and historical data analysis to meet end-user requirements at optimal inventory levels\n• Execute the operation and output of reliable planning and suggested inventory models based on detailed inputs from end-users, MRP analysts and forecasting models to inform category decisions across the region\n• Adhere to the standards and guidelines for inventory management • Execute the fulfilment modes for material segments/items\n• Ensure that master data parameters for new and existing items are updated to the correct standards e.g. attributes\n• Drive the working capital optimization opportunities for execution e.g. disposal of excess and obsolete stock\n• Provide input into frontloading, identification and sizing of initiatives relating to working capital benefits\n• Ensure that inventory optimization events are planned, scheduled, resourced, and executed in a timely and visible manner \n• Implement inventory optimization initiatives to minimize wastage at the operations to minimize Anglo American’s carbon footprint \n• Implement working capital optimization opportunities and identify and ensure the execution of cost reduction initiatives that positively impacts cost to serve\n• Maintain stakeholder relationships within the Supply Chain, key suppliers and internal end-users (maintenance & production teams) to enable effective planning and fulfilment of demand\n• Provide advice to stakeholders regarding MRP and demand planning processes\n• Embrace a Supply Chain team culture of diversity and inclusiveness \n \nQualifications:\nAn undergraduate qualification - Bachelor degree level or equivalent, alternatively relevant tertiary qualification\nDesirable: A postgraduate qualification in a relevant discipline OR a proven track record of extensive practical experience in a role and context of similar complexity.\n \nExperience and Technical Knowledge:\n• Sound knowledge of systematic capabilities and systems materials planning, i.e., demand algorithms and statistical models and operation thereof\n• Experience working in a complex environment and managing multiple internal and external stakeholder perspectives\n• Experience in demand forecasting and planning abilities\n \nAn ability to apply the following skills at a defined level of proficiency required for the role:\n• Material Planning (Advanced)\n• Planning (Competent)\n• SC Systems & Processes (Competent)\n• Stakeholder Engagement and Communication (Competent)\n•  Project Management (Developing)\n• Technical Analysis (Competent)\n• Safety knowledge (Competent)\n• Business Acumen (Developing)\n• Logistics Management (Competent)\n• Warehouse Management (Developing)\n• Driving Performance (Developing)\n• Leading Change (Developing)\n• Optimization (Developing)\n \n \nAdditional information:\nWho we are\nWe aim to lead the industry by pursuing ever safer and more responsible ways of working, demonstrating integrity and showing care and respect for people and the planet. That means we are constantly seeking new opportunities to mine and process our products sustainably, using less water, less energy and more precise extraction technologies. As the custodians of coal and other precious natural resources – diamonds (through De Beers), copper, platinum and other precious metals, iron ore and nickel – our extraordinary teams work safely and collaboratively, with the utmost consideration for local communities, our customers and the world at large.\n\nHow we are committed to your safety\nNothing is more important to us than ensuring you return home safely after a day’s work. To make that happen, we have the most rigorous safety standards in the industry. Not only that, we’re also continually investing in new technologies – from drones to data analytics – that are helping to make mining safer.\n\nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential.\n\nHow to apply\nTo apply for this role, please complete our online application form. You will have the opportunity to upload your CV and other relevant documentation as part of the process.\n \n \n \n ", " \n \n \n \n \nACCOUNTS PAYABLE ADMINISTRATOR\nBusiness Unit / Group Function: Element Six\nDiscipline: Business Support Services\nLocation: Springs, South Africa\nReference Id: REF63020O\nExperience / Work Type: Entry Level / Fixed Term Employee\nClosing Date: 02 September, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nWho we are \nElement Six (E6), is a global leader in the design, development and production of synthetic diamond and tungsten carbide super materials. Part of the De Beers Group, our primary manufacturing sites are located in UK, Ireland, Germany, South Africa and the US. \n \nOur mission \nWe put our customers first. Using our technological expertise and industrial leadership we deliver innovative solutions to achieve competitive advantage. \n \nOur vision \nWith access to the most sophisticated R&D technology and the best minds in the business, the future is full of possibilities… \n \nEmployment Equity & Inclusion and Diversity \nThe Company's approved Employment Equity plan and targets will be considered as part of the recruitment process.  We are committed to fostering a vibrant workplace culture that is inclusive and embraces our diversity, where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential and thrive. \n \nJob Description:\nJob Overview \nThe suited candidate will be expected to work under pressure, on tight deadlines, be a good communicator and have pristine attention to detail. This role requires an energetic and enthusiastic individual who thrives in a fast paced and demanding environment.  \n \nDuties and tasks \nPreparation and review of creditors reconciliations before payments are made. \nMatching, batching, and processing of invoices on local, group and foreign suppliers. \nEnsuring payments are made to suppliers on time and according to the payment policy. \nEngaging with creditors in a professional manner ensuring all queries are resolved timeously. \nFollowing up on outstanding payments and clearing of old invoices for suppliers on the received not vouchered account as well as the creditors age analysis. \nPreparing monthly local accruals listing \n \nQualifications:\nQualifications and experience \nNational Diploma in Accounting (Or studying towards a financial qualification). \nExperience in the field is not required but would be advantageous.\n \nCriteria and Skills \nComputer literacy- Advanced Excel and ERP system skills. \nDetail orientated. \nStrong analytical and problem-solving skills with broader strategic skills. \nTime management skills. \nCommunication and presentation skills. \nDecision making skills. \nExcellent interpersonal skills  \nFuturistic strengths and vision. \n \n \n \n ", " \n \n \n \n \nARTISAN ELECTRICIAN -TMM\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Engineering\nLocation: Musina, South Africa\nReference Id: REF63037T\nExperience / Work Type: Entry Level / Permanent Employee\nClosing Date: 19 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nBe part of the team. The team that makes it happen.\nYou enjoy being part of a talented and diverse team and can communicate easily and openly with your colleagues.\nYou are also passionate about quality work and know that good communication does not just happen – a great deal of care is taken to ensure accuracy, consistency, and timeliness.\nWith a fascinating product, a global business, and great stories to tell, come and be part of our team.\nWe’re the world’s leading diamond company – a unique luxury business that thrives on the creativity, passion, and knowledge of our people.\nTo push our company forwards, we always need to think differently. We welcome diverse perspectives, people who spark fresh thinking and aren't afraid to challenge assumptions.\nIn return, we provide you with the space and support to grow and achieve your ambitions.\n \nJob Description:\nThe Engineering Trackless Mobile Machinery (TMM) Artisan Electrician in the VUP area necessitates a suitably qualified incumbent who will be required to maintain and assist in the operation of TMM equipment and systems according to sound engineering practice and equipment specifications.\nOur dedication to quality and high performance extends to our workforce, so we seek talented, ambitious people who will thrive in an environment which fosters individuality, inclusivity and creativity. If you like the idea of challenging and stimulating work in a diverse team, we'd like to hear from you.\n \nKey Tasks:\nYour role will include but not limited:\nPlan activities in accordance with production schedules and allocation of resources as required.\n Assist in ensuring that TMM electrical equipment and electrical installations meet the required designs, installation and maintenance standards.\nEnsure that all assessments of potential hazards for the operation of equipment and installations are undertaken in accordance with procedures.\nMaintenance and repairs of all TMM electrical equipment in the underground, specifically with regards to the following: Drill Rigs (DD320, DD321, DD321, DD420, DD421 & DD422i), Long Hole Rigs (DL421, DL422i, DL432i & Rhino Machine), Cable Bolters (DS421, DS422i & DS412i), Roof Bolters (DS411), Maclean Bolter (946), LHD (LH410, LH517i & LH621i), Dump Trucks (TH430), TH540 & TH551i), Atlas Copco (M4C,ME7) Shotcrete (Normet), Manitou and Agicars etc.\nEnsure fixed, mobile and transportable TMM electrical equipment associated with hot work or live testing, installed or operated are suitably certified in line with operational standards.\nEnsure that equipment is suitable for use in the underground mine.\nEnsure that the maintenance and overhaul of TMM electrical equipment installed and/or operated or intended to be installed and/or operated is in accordance with relevant standards.\nAlign with planned maintenance, including the maintenance of relevant records for all electrical equipment and electrical installations in the area of responsibility.\nAdherence to policies and procedures.\nEnsure effective communication to relevant stakeholders to minimize production delays.\nUpholding of safety, health and environmental standards to achieve ZERO HARM.\nTraining and development of subordinates.\n \nQualifications:\nGrade 12 / N3 / Equivalent NQF Level 4 qualification with pure Mathematics and Physical  Science\nRelevant Trade Certificate Electrician\nMQA – MV Switching Certificate\nValid EB / Code 8 Driver's License\n \nExperience:\nMinimum of 3 years’ experience in TMM electrical maintenance in an underground mining environment.\nSound knowledge in the maintenance, repairs and fault finding of the following equipment: Drill Rigs (DD320, DD321, DD321, DD420, DD421 & DD422i), Long Hole Rigs (DL421, DL422i, DL432i & Rhino Machine), Cable Bolters (DS421, DS422i & DS412i), Roof Bolters (DS411), Maclean Bolter (946), LHD (LH410, LH517i & LH621i), Dump Trucks (TH430), TH540 & TH551i), Atlas Copco (M4C,ME7) Shotcrete (Normet), Manitou and Agicars etc.\n Sound knowledge on how the Booyco PDS systems work.\nSound knowledge on Rig Control systems (RCS).\nMust be able to read and understand schematic diagrams including symbols.\nStrong electrical troubleshooting skills with regards to problems in UG TMM mining and ancillary equipment.\nPlanning and control of maintenance schedules as per SAP PM.\n \nAdditional Requirements:\nComputer literacy – MS Office Suite\nBe prepared to work shifts, do standby duties, callouts, and work overtime as per the role requirement.\nSuccessfully obtain a Medical Certificate of Fitness to work underground.\nThe post is dependent on the successful completion of the Company’s pre-employment protocol such as qualifications verification, relevant psychometric and technical assessments, and security clearance.\n \nAdditional information:\nBackground Checks:\nBy applying for this job, you provide consent that your personal details, including your fingerprints, can be used to conduct background screening where appropriate.\n \nHow to Apply:\nTo apply for this role, please complete our online application form. You will have the opportunity to upload your CV and other relevant documentation as part of this process.\nPreference will be given to Venetia employees who meet the criteria\n For all internal applicants, you are required to complete an internal application form and attach detailed CV. This for must be accompanied with a signature from your immediate Line Manager and Head of Department, failure to do so will render your application invalid.\n\nWho we are:\nDe Beers Group is a company with a sparkling future.\nOur experts have searched the world for nature’s most precious gem. Our diamonds bring beauty to the world. But we think they can do so much more. We want our diamonds, and our business, to make life brilliant – for our people, our customers, and the world around us.\n \nOur Values:\n\nSafety\nSafety first is a way of life for us. We are unconditional about the safety, health and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.\n\nEquity, Diversity & Inclusion\nAs a global #HeForShe Thematic Champion, De Beers is committed to promoting an equitable, inclusive and diverse workplace where we value and respect every colleague for who they are. We provide equality of opportunity to enable everyone to fulfil their potential. Please inform us should there be any special requirements that should be considered as part of your application.\n\nBuilding Forever\nSustainability is at the heart of our decision-making – it is how we do business. Building Forever is key to our purpose as it represents our ambitious and holistic sustainability framework and is central to our ability to deliver long-term value to our communities and partners. This shapes how we protect our social and environmental license to operate, build a long-term legacy in our host communities and earn consumers’ trust in our diamonds that they can wear with pride.\n \n \n \n \n ", " \n \n \n \n \nSENIOR REPORTING ANALYST\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Finance\nLocation: Cape Town, South Africa\nReference Id: REF62968E\nExperience / Work Type: Associate / Permanent Employee\nClosing Date: 16 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nDe Beers Technology business\nDe Beers Technology Business have operations in both Cape Town and Johannesburg, South Africa and is part of the De Beers Group. We deliver technical services and technology systems to increase the efficiency and effectiveness of the De Beers Diamond value chain (from exploration to diamond recovery). Activities include marine geophysical survey, sampling, and mining, projects, engineering, technology development and maintenance. Projects include the establishment and development of a fleet of mining ships and all associated equipment. We provide specialized diamond processing and recovery technology for the De Beers Group Exploration and Mining Operations. We are the industry leader in marine mining practices resulting in the most successful and advanced marine mining equipment and operations globally.\n \nJob Description:\nThe role is responsible for delivering the long-term business planning, assessment, and analysis of current and future sales performance of the Technology Business. This role is includes delivering high quality Business Planning and Performance Reporting outputs and to clearly articulate key messages to Senior management.\n \nKey responsibilities include:\nDevelop a pricing model, costing and benefit quantification which also supports continues research and development. aligned to the Technology Business strategy.\nAnalyse, and maintain a pricing model for products and services; establish and propose market prices for the services and products that allows the business to maximise profits whilst also remaining competitive.\nThis role is also responsible for analysing costs and sales prices to seek for an optimum price for the business by considering competitor prices and company overheads.\nDevelop and projecting the short- and long-term revenue and ensuring that the desired profit is achieved for the business.\nEstablishing sales prices and working closely with the Business development and Products team; and maintaining the price book for products and services.\nDrive continuous development and maturisation of the pricing model inclusive of rates schedule.\nProvide high quality, complete and detailed analysis of results compared to forecast in close interaction the Business Unit Managers, including understanding, and explaining key drivers of results.\nEnsure that the pricing as stipulated in the framework agreement is aligned to the approved price book and rates schedule and by adopting a strong working relationship with the Commercial and Compliance section.\nContribute towards operational efficiency by identifying opportunities for improving data, systems, and processes/procedures.\nDevelop and maintain sound working relationships with service providers & clients, to ensure continued sustainability.\n \nQualifications:\nFinancial / Business  Science degree with a CA (SA) qualification\n \nKnowledge And Experience required.\n3-5 years of a proven track record of practical experience in a role and context of similar complexity.\nAdvanced Accounting Package/Software and Systems knowledge and skills - HFM, HSF/OneStream and SAP.\nProven track record of practical experience in a role and context of similar complexity.\nAdvanced Financial Reporting and Consolidation knowledge.\nKnowledge and application of IFRS and Tax\nFinancial analysis aptitude and ability to provide quality recommendations and solutions\n \nAdditional information:\nWho we are:\nDe Beers Group is a company with a sparkling future.\nOur experts have searched the world for nature’s most precious gem. Our diamonds bring beauty to the world. But we think they can do so much more. We want our diamonds, and our business, to make life brilliant – for our people, our customers, and the world around us.\n \nSafety\nSafety first is a way of life for us. We are unconditional about the safety, health, and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.\n \nEquity, Diversity & Inclusion\nAs a global #HeForShe Thematic Champion, De Beers is committed to promoting an equitable, inclusive, and diverse workplace where we value and respect every colleague for who they are. We provide equality of opportunity to enable everyone to fulfil their potential. Please inform us should there be any special requirements that should be considered as part of your application.\n \nBuilding Forever\nSustainability is at the heart of our decision-making – it is how we do business.  Building Forever is key to our purpose as it represents our ambitious and holistic sustainability framework and is central to our ability to deliver long-term value to our communities and partners. This shapes how we protect our social and environmental license to operate, build a long-term legacy in our host communities and earn consumers’ trust in our diamonds that they can wear with pride.\n \nBackground Checks\nSuccessful candidates will be required to complete background screening which may include a criminal check and validation of qualifications.\n \nEligibility\nThis role is open to all individuals, and we will support employees who might need to relocate.\n \n \n \n \n ", " \n \n \n \n \nPS SYSTEMS ADMINISTRATOR\nBusiness Unit / Group Function: Africa - Platinum Group Metals (PGMs)\nDiscipline: Business Support Services\nLocation: Polokwane, South Africa\nReference Id: REF63052L\nExperience / Work Type: Entry Level / Permanent Employee\nClosing Date: 15 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nWe have an exciting position for a Systems Administrator to provide support to all Crime system users and management at the operation, specific application training, data testing, maintenance and the generation of administrative and statistical reports. This role will also act as the contact person between the System users on the Operations and Crime Analysis Risk Unit to ensure all technical issues, system flags and related queries are addressed appropriately and timely.\n \nYou put safety first.  That’s why we want you.\nSafety first is a way of life for us.  We are unconditional about the safety, health and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.\n \nPlatinum\nOur Platinum business mines, processes, and refines the entire range of platinum group metals (PGMs): platinum, palladium, rhodium, ruthenium, iridium and osmium. We are the world’s leading primary producer of PGMs, which have a range of specialised applications that improve lives across the world, from vehicle fuel cells to jewellery; dentistry to glassmaking; pacemakers to petroleum refining.\n \nJob Description:\nYour day-to-day duties will include:\nTimely, comprehensive and accurate response to System flags, queries and requests.\nUpdate and maintain User access, security permissions and data uploads, field requirements and Admin pages.\nUpdate and maintain Audit protocols, data checklists, business rules and queries.\nContinuous cleaning of data to find duplicates and identify links on unstructured data to enhance Data integrity.\nContinuous review of audit protocols, data checklists, business rules and queries to find best practices to enhance crime systems.\nGenerate comprehensive and accurate statistical and crime hotspots reports, information reports, system reports, graphs, administration reports and presentations.\nUpdate and maintain system output reports through constant data integrity checks and analysis.\nUpdate and maintain the statistical templates.\nConduct all work according to required standards and procedures.\nPerform ad hoc tasks given by Protection Services Senior Analyst.\nEnsure that Training material of the related Crime systems are kept up to date in relation to any changes in the Crime systems or Crime reporting related protocol.\nConduct the necessary training to ensure each user understands their role and can perform his/her role in the related Crime systems effectively.\nUpdate and maintain the System and Crime reporting related protocol documentation and conduct training workshops to keep users up to date with any changes relating to System and Crime reporting related protocol.\nEnsure a competent user base with high level of integrity on information through continues review of data integrity, identifying user errors and providing support to users to increase data quality.\nUpdate and Maintain System manuals and all documentation related to the Crime systems in relation to any changes in the Crime systems or Crime reporting related protocol.\nIdentify opportunities to improve Crime systems or Crime reporting related protocol and share best practice solutions.\nEffective control of the Office Administration and Filing system.\nThis role is in the Processing Protection Services at a C1 level reporting to the Protection Services Senior Superintendent.\n \nQualifications:\nGrade 12\nRegistered with the PSIRA on grade B\nValid driver’s license code 08/10/14\nComputer Certificate advantageous\n \nExperience required: \nMinimum 3 years’ experience in Security or equivalent environment\nIntermediate level of computer literacy: MS Office, SAP systems and security systems (Bi or iBase) • Basic knowledge of applicable business reports writing\nCommunications in English (spoken, written, and reading)\nNumeracy and Literacy\n \nAdditional information:\nWhat we offer\nWhen you join Anglo American, you can expect to enjoy a competitive salary and benefits package, but more than this, you’ll find yourself in an environment where the opportunities for learning and growth are second to none. From technical training to leadership programmes, we bring out the best in our people. There are plenty of opportunities to move onwards and upwards too. We are a large, successful multinational company – and we are still growing all the time.\n \nWho we are\nAnglo American is a global diversified mining business. Our portfolio of world-class mining operations provides the metals and minerals that make modern life possible. We use innovative practices and the latest technologies to discover new resources and mine. We work together with our key partners and stakeholders to unlock the sustainable value that those resources represent for our shareholders, the communities and countries in which we operate and for society at large. Anglo American is re-imagining mining to improve people’s lives.\n \nHow we are committed to your safety\nNothing is more important to us than ensuring you return home safely after a day’s work. To make that happen, we have the most rigorous safety standards in the industry. Not only that, we’re also continually investing in new technologies – from drones to data analytics – that are helping to make mining safer.\n \nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential.\n \nBackground checks\nSuccessful candidates will be required to complete background screening which may include a criminal check and validation of qualifications.\n \nHow to apply\nTo apply for this role, please complete our online application form. You will have the opportunity to upload your CV and other relevant documentation as part of this process.\n \nClosing Date: 15 July 2024\n \n \n \n \n ", " \n \n \n \n \nPERFORMANCE MANAGER\nBusiness Unit / Group Function: Africa - Platinum Group Metals (PGMs)\nDiscipline: Finance\nLocation: Johannesburg, South Africa\nReference Id: REF63063S\nExperience / Work Type: Associate / Permanent Employee\nClosing Date: 14 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nCome and join us as a Performance Manager (Data Management) where you will be responsible for Anglo American Platinum Group, data requirements and to the majority shareholder, Anglo American Plc.\nFinances are vital. You’ll help us see where we’re going.\nAnglo American aspires to become the most valued mining company in the world, and to achieve this ambition we are implementing a radical programme – which is currently transforming and improving many of the ways in which our teams work.\nWe are focused on simplification and standardisation, with the aim of significantly reducing the amount of time our people spend on manually working with data. We want to help our business to meet ambitious targets, so individuals joining us will be equipped with new skills and better tools to provide new insights and further drive business performance.\n \nPlatinum\nOur Platinum business mines, processes and refines the entire range of platinum group metals (PGMs): platinum, palladium, rhodium, ruthenium, iridium and osmium. We are the world’s second largest primary producer of PGMs, which have a range of specialised applications that improve lives across the world, from vehicle fuel cells to jewellery; dentistry to glassmaking; pacemakers to petroleum refining.\n \nJob Description:\nAs a Performance Manager, you will drive systems optimisation to create efficiencies within reporting.\n \nYour responsibilities will include:\nCoordinate and manage the planning process for month end, forecasts and budgets\nCoordinate and collaborate with other functions for the forecast/budget assumptions to be included when preparing the group Income statement, Balance sheet and cash flow statements \nResponsible for all month end tasks of loading data in Essbase and consolidation of data for the group view\nManage and perform other ad-hoc analytical/modelling work to provide insights into critical decision factors \nIntegration with SAP on all month end data sets. Ensure all data is verified and correct.\nPrepare the group consolidations for the Income statement, Balance Sheet and Cash flow statements for forecast and budget\nManage data input for model from functions within Platinum \nDevelop long and medium term financial reports \nContinuously update information database in respect of area of responsibility \nResearch on changes in legislation benchmarks as well as best practices, etc. \nDevelop own work program and budgets as appropriate \nEnsure adherence to governance framework \nLiaise with techno-financial modelling consultants/contractors / external service providers \nEvaluation, analysis and interpretation of actual performance\nPerform and interpret actual trends and forecast accordingly\nCompilation of Month end/ budget standard reports\nAudit related reports for internal and external audit attestations Responsible for interims and year end reporting data requirements\nPreparation of presentations\n \nQualifications:\nCA (SA)\n \nExperience:\n5-7 years experience in performance reporting and management accounting (mining background advantageous)\nProven experience in a financial analysis role in a large multinational environment\nMust have extensive experience in performance reporting activities coupled with analysing & coordinating large volumes of data, thus interpreting these into various reports\nMust have advanced MS office experience (Excel and PowerPoint)\nAdvanced data analysis and management for decision-making\nAdvanced management of work packages across a portfolio of project activities\nProficient in financial systems and related legislation\nAdvanced computer literacy for role including SAP\nProficient in budgeting and forecasting\nAdvanced knowledge in IFRS/SA Tax and Companies Act knowledge\n \nAdditional information:\nWhat we offer \nWhen you join Anglo American, you can expect to enjoy a competitive salary and benefits package, but more than this, you’ll find yourself in an environment where the opportunities for learning and growth are second to none. From technical training to leadership programmes, we bring out the best in our people. There are plenty of opportunities to move onwards and upwards too. We are a large, successful multinational company – and we are still growing all the time.\n\nWho we are\nAnglo American is a global diversified mining business. Our portfolio of world-class mining operations provides the metals and minerals that make modern life possible. We use innovative practices and the latest technologies to discover new resources and mine. We work together with our key partners and stakeholders to unlock the sustainable value that those resources represent for our shareholders, the communities and countries in which we operate and for society at large. Anglo American is re-imagining mining to improve people’s lives.\n \nHow we are committed to your safety\nNothing is more important to us than ensuring you return home safely after a day’s work. To make that happen, we have the most rigorous safety standards in the industry. Not only that, we’re also continually investing in new technologies – from drones to data analytics – that are helping to make mining safer.\n \nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential.\n \nBackground checks\nSuccessful candidates will be required to complete background screening which may include a criminal check and validation of qualifications.\n \nHow to apply\nTo apply for this role, please complete our online application form. You will have the opportunity to upload your CV and other relevant documentation as part of this process.\n \nClosing Date: 14 July 2024", " \n \n \n \n \nARTISAN DIESEL MECHANIC\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Engineering\nLocation: Musina, South Africa\nReference Id: REF63024X\nExperience / Work Type: Entry Level / Permanent Employee\nClosing Date: 14 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nInclusive, supportive and innovative - come and be part of our bright future at Venetia! South Africa’s most valuable diamond mine is currently being developed underground. This opportunity allows you to be part of one of the largest infrastructure projects in the country.\nAs an Artisan – Diesel Mechanic, you will be responsible for maintain and repair machinery and diesel-powered vehicles, engines and mechanical systems according to sound engineering practice and equipment specifications.\nOur dedication to quality and high performance extends to our workforce, so we seek talented, ambitious people who will thrive in an environment which fosters individuality, inclusivity and creativity. If you like the idea of challenging and stimulating work in a diverse team, we'd like to hear from you.\n \nJob Description:\nYour responsibilities will include but not limited to:\nBuild and assemble machines or mechanical components according to requirement\nInspect machines, engines, transmissions and run diagnostic tests to discover functionality issues\nConduct repairs aiming for maximum reliability and availability\nTroubleshoot reported problems and resolve them in timely manner\nPerform thorough maintenance and repairs on machinery, equipment and systems with specific regard to the following: Drill Rigs (DD320, DD321, DD321, DD420, DD421 & DD422i), Long Hole Rigs (DL421, DL422i, DL432i & Rhino Machine), Cable Bolters (DS421, DS422i & DS412i), Roof Bolters (DS411), Maclean Bolter (946), LHD (LH410, LH517i & LH621i), Dump Trucks (TH430), TH540 & TH551i), Shotcrete (Normet) , Manitou and Agicars etc.\nProvide consultation on correct maintenance and preventative measures to machine or vehicle users\nKeep logs of work and report issues\nPerform Inspections in accordance the Mine Health & Safety Act regulations, manufacturing and company standards to report all defects and breakdowns on equipment and machinery to the Supervisor\nPlanning of activities in accordance with production schedules and allocation of resources as required\nEffective communication to relevant stakeholders to minimize delays\nAdherence to policies and procedures.\nUpholding of safety, health and environmental standards to achieve ZERO HARM.\nTraining and development of subordinates.\nThis role is in the VUP Engineering department at a CL level reporting to the Senior Engineering Foreman.\n \nQualifications:\nGrade 12 / N3 / Equivalent NQF Level 4 qualification with pure Mathematics and Physical  Science\nRelevant Trade Certificate (Diesel Mechanic)\nValid EB / Code 8 Drivers License\n \nExperience Required:\nMinimum 3 years continuous experience as a Diesel Mechanic in TMM maintenance in an underground mine is essential.\nSound knowledge in the maintenance, repairs and fault finding of the following TMM equipment: Drill Rigs (DD320, DD321, DD420, DD421 & DD422i), Long Hole Rigs (DL421, DL422i, DL432i & Rhino Machine), Cable Bolters (DS421, DS422i & DS412i), Roof Bolters (DS411), Maclean Bolter (946), LHD (LH410, LH517i & LH621i), Dump Trucks (TH430), TH540 & TH551i), Shotcrete (Normet), Manitou and Agicars etc.\nAbility to understand and read technical drawings to do fault finding.\nPlanning and control of maintenance schedules as per SAP PM.\nComputer literacy – MS Office Suite\nImportant: Applications without supporting documents will not be considered\n \nAdditional information:\nBe prepared to work shifts, do standby duties, callouts, and work overtime as per the role requirement.\nSuccessfully obtain a Medical Certificate of Fitness to work underground.\nYour consideration for employment is subject to:\nSAPS Criminal Record verification and a valid EB / Code 8 Drivers License. \nQualifications Verification.\nRelevant Psychometric and Technical Assessments\n \nHow to Apply\nTo apply for this role, please complete our online application form. You will have the opportunity to upload your CV and other relevant documentation as part of this process.\nPreference will be given to Venetia employees who meet the criteria.\nFor all internal applicants, you are required to complete an internal application form and attach detailed CV. This for must be accompanied with a signature from your immediate Line Manager and Head of Department, failure to do so will render your application invalid.\n \nBackground Checks\nBy applying for this job, you provide consent that your personal details, including your fingerprints, can be used to conduct background screening where appropriate. For more information, please visit: https://www.angloamerican.com/site-services/applicant-privacy-notice/applicant-privacy-notice-en\n \nPrivacy Statement\nAnglo American/ De Beers Group collects and processes personal data in accordance with the relevant regulations. For more information, please visit: https://www.angloamerican.com/site-services/applicant-privacy-notice/applicant-privacy-notice-en\n \nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential.\n \nClosing Date: 14 July 2024\n \n \n \n \n ", " \n \n \n \n \n \nPRINCIPAL PROJECT CONTROLS & REVIEW - SOUTH AFRICA\nBusiness Unit / Group Function: Projects & Development\nDiscipline: SIB & Construction Management\nLocation: Johannesburg, South Africa\nReference Id: REF62564F\nExperience / Work Type: Mid-Senior Level / Permanent Employee\nClosing Date: 12 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nWe’re re-imagining mining to improve people’s lives. That includes the lives of everyone who works for Anglo American. We strive to be a great company where employees are happy, inspired to do their best work. A place where every colleague can grow, develop and realise their potential. To live up to our Always with Purpose employee value proposition, we’re putting the development and growth of colleagues first by ensuring everyone at Anglo American has the career experience they deserve.\n \nJob Description:\nPurpose of the role:\nTo establish and  manage the Project Controls functions, systems, and procedures to assure the definition of schedules, budgets and forecast costs for effective  project management.  Project Controls duties include:\nPlanning, Scheduling, and Project Progress Measurement\nCapital Cost Estimating & Project  Risk Management\nCost Control, Budgeting & Cost Forecasting\nRecords and Document Management\nManagement and Project Reporting\n \nKey Responsibilities:\nGeneral\nAct as regional representative and “First Point of Contact” for Anglo American (AA) P&D Project Controls Group and provide coordination with AA Project Controls Teams in the region.\nProvide leadership and day-to-day technical direction to Project Controls Teams and Study/Project Managers, focused on studies and projects for the region.\nEvaluate technical and resource requirements of Project Controls for the studies/projects in the region.\nEnsure implementation of AA Project Controls Standards and Guidelines.\nCoordinate with HR and SCM/Project Commercial to source Project Controls personnel for Studies & Projects\nAssist in the preparation of Investment Proposal documentation.\nPlanning and Scheduling\nProjects Integrated Planning Session (IPS) - Ensure Studies and Projects conduct IPS’ and coordinate with the AA Principal Scheduler to ensure proper facilitation of the sessions.\nEnsure preparation of project schedules as defined in the AA and Scheduling Standard.\nEnsure regular updating of detailed schedules for owner’s and contractor’s scope (including Engineering, Procurement, Construction, and Commissioning activities).\nDefine, ensure implementation and updating of the progress and performance reporting, including contractor’s progress measurements.\nClosely monitor the progress of contractors to ensure deliverables, productivity, expended hours, forecasts to go and resources employed, are accurately and realistically stated.\nInitiate and facilitate weekly schedule status reviews, analysis of schedule trends and formulation of recommended corrective action; and participate in Contractor’s status meetings.\nQuality Assure all required reports and schedule information.\nEstimating and Benchmarking\nPrepare or ensure preparation of capital cost estimates, control budgets and forecasts for Owner’s scope, for combination with contractor’s input into an overall project budget and forecast.\nCoordinate with the AA Principal Estimator, the development of each Capital Cost Estimate as defined in the AA Capital Cost Estimating and Scheduling Standard.\nBenchmarking – Coordinate with the AA Principal Estimator to provide the appropriate benchmark information for the development of Study Stage Capex and Opex estimates or as checks for later stage estimates.\nEnsure Qualitative and quantitative risk assessments are complete for projects in line with the AA Project Risk Guideline.\nCost Control and Reporting\nDevelopment and implementation of the Study or Project WBS, including the project cost coding structure to meet estimating, cost control, engineering, document control and other project reporting requirements and compatible with AA’s operating requirements.\nAccountable for the preparation of cost reports for both the Owner’s scope and contractor’s scope of work associated with T&S - Group Projects managed work.\nMaintain accurate records of committed, expended, and forecast costs associated with the study/project against the approved budgets.\nImplement cost forecasting and change management process for Owner’s and contractor’s cost; and ensure timely initiation of cost change variations are recorded and processed.\nPrepare cash flow forecasts of forthcoming financial requirements including commitment curves for the project.\nReview contractor’s progress reports in detail to ensure they are accurate, concise and informative on progress / costs to date and forecasts through to completion.\nProduce the monthly progress reports for projects/studies, and where appropriate, ensure that consolidation of the Owner’s scope with contractor’s reports into one overall report.\nCoordinate with the Finance Department to ensure that generally accepted accounting principles are applied to the project; perform invoice processing; record all actual project costs; perform financial reporting; interface with cost control.\nEnsure the establishment of Project Controls computer systems appropriate for the needs of the project in both home offices and field sites.\nRecords & Document Control\nAccountable for the establishment of the records management software in the region.\nImplement records and document control processes on projects in line with AA Records Management Guideline\nThe above duties and responsibilities are representative of the nature and level of work assigned and are not necessarily all-inclusive.\n \nRole-specific knowledge:\nA demonstrated thought leader and considered an external expert in the understanding and application of integrated policies and practices for all Project Controls disciplines (Estimating, Planning/Scheduling/Progressing, and Cost Control)\nTrack record of leading ideas generation; translating these into practical initiatives to be implemented and demonstration of successful execution and delivery in Project Controls (Estimating, Planning/Scheduling/Progressing, and Cost Control) practices.\nExtensive knowledge of Project Controls Excellence (Estimating, Planning/Scheduling /Progressing, and Cost Control) over the complete project life cycle\nSignificant knowledge of the region being represented, fluent in the local language and cultures; as well as, a working knowledge of the regional engineering and construction markets, companies, and methods of doing business.\nExperience:\n10-15 years experience\nManagerial/Supervisory experience needed\nTechnical background would be advantageous\n \nQualifications:\nDesirable - An undergraduate qualification (Bachelors / Honours degree or equivalent) in a relevant technical discipline  \nA proven track record of extensive practical experience in a role and context of similar complexity is required.\n \nAdditional information:\nWho we are:\nWe aim to lead the industry by pursuing ever safer and more responsible ways of working, demonstrating integrity and showing care and respect for people and the planet. That means we are constantly seeking new opportunities to mine and process our products sustainably, using less water, less energy and more precise extraction technologies. As the custodians of coal and other precious natural resources – diamonds (through De Beers), copper, platinum and other precious metals, iron ore and nickel – our extraordinary teams work safely and collaboratively, with the utmost consideration for local communities, our customers and the world at large.\n \nHow we are committed to your safety\nNothing is more important to us than ensuring you return home safely after a day’s work. To make that happen, we have the most rigorous safety standards in the industry. Not only that, we’re also continually investing in new technologies – from drones to data analytics – that are helping to make mining safer.\n \nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential\n \n \n \n \n ", " \n \n \n \n \nOPERATIONAL RISK OFFICER\nBusiness Unit / Group Function:\nAfrica - Platinum Group Metals (PGMs)\nDiscipline: Safety\nLocation: Mokopane, South Africa\nReference Id: REF63053C\nExperience / Work Type: Entry Level / Permanent Employee\nClosing Date: 12 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nCome and join this dedicated team as our Operational Risk Officer. The Operational Risk Officer will be responsible to provide operational support in the implementation and execution of Operational  Risk Management at mining and process operations.\nYou put safety first.  That’s why we want you.\nAnglo American is a global diversified mining business. Our portfolio of world-class mining operations provides the metals and minerals that make modern life possible. We use innovative practices and the latest technologies to discover new resources and mine, process, move and market our products to our customers around the world.\nOur Platinum business mines, processes and refines the entire range of platinum group metals (PGMs): platinum, palladium, rhodium, ruthenium, iridium and osmium. We are the world’s leading primary producer of PGMs, which have a range of specialised applications that improve lives across the world – from vehicle fuel cells to jewellery; dentistry to glassmaking; pacemakers to petroleum refining. \n \nJob Description:\nJob responsibilities include (but are not limited to):\nPlan, implement and coordinate the implementation of ORM to all aspects of the operational risk profile.\nSupport and coordinate the application of the ORM four layers of  risk management at the operation; Baseline  risk management, Issue-based risk management, Task risk management, Continuous risk management\nImplement and execute operationally against the integrated risk management framework operational risk management processes, systems, standards and procedures.\nImplement and maintain the functioning of operational risk management IT Platform.\nPlan and implement the Annual Operational Risk Programme and ensure support managerial oversight of the delivery of operational risk targets and key results areas.\nAdvise the operation on required skills development to enhance the skills and competencies of employees and contractors to achieve excellence in operational risk management.\nReport, monitor and track operational risk performance to  risk management role holders and operational management and leaders.\nProvide  risk based operational input to operation to ensure management of material risks, audit results and Learning from Incidents.\nRoutinely advise operational line role holders, managers and leaders operational risk performance and necessary actions.\nSupport required integration of operational  risk management into leading operational practices and programs such as the Operating Model, incident investigation and assurance practices.\nParticipate in all team engagements where required.\nAdhere to external local compliance requirements as a minimum level of site performance.\nAdhere to Anglo American compliance requirements and ensure compliance of team.\nAdhere to compliance governance within the team.\nOther compliance requirements as assigned by the Manager.\nThis role is at a Band 7 level reporting to the Operational Risk Coordinator.\n \nQualifications:\nEssential requirement: educated to a minimum of a national diploma level in a relevant discipline or equivalent (such as  sciences, engineering or other related careers)\nPreferable requirement: Courses in management systems (9001, 14001, 18001), risk qualification, audit qualification\n \nExperience, Knowledge and Skills\nDetailed understanding of the Platinum value chain and operational trends and risks.\nMinimum of 5 years relevant operational mining, processing, and engineering related experience\nAn understanding of the operational aspects associated with mining operations.\nDemonstrated understanding of  risk management within a technical environment\nKnowledge and experience with risk assessment techniques such as WRAC,\nBow-tie Analysis, HAZOP/HAZAN and other industry recognised techniques and tools.\nTrack record of interfacing with and influencing colleagues and coordinating disciplines relevant to  risk management.\nDesirable: Ability to use operational risk management system for input and data analysis (e.g.: Enablon, Bowtie XP, Isometrix, CURA, IHS, etc.)\nTranslate recommendations into tangible operational outcomes.\n \nAdditional information:\nAbility to speak additional languages is desirable.\nMust have Code EB drivers licence\nRegional and domestic travel may be required\nWorking on operational mine and process sites (both open pit and underground) will be required. This may involve activities of a physical nature in a typical mine environment (for example noise, vibration, heat, small spaces, reduced visibility\n \nWho We Are\nWe aim to lead the industry by pursuing ever safer and more responsible ways of working, demonstrating integrity and showing care and respect for people and the planet? That means we are constantly seeking new opportunities to mine and process our products sustainably, using less water, less energy and more precise extraction technologies.\nAs the custodians of coal and other precious natural resources – diamonds (through De Beers), copper, platinum and other precious metals, iron ore and nickel – our extraordinary teams work safely and collaboratively, with the utmost consideration for local communities, our customers and the world at large.\n\nWhat We Offer\nWhen you join Anglo American, you can expect to enjoy a competitive salary and benefits package. But more than this, you’ll find yourself in an environment where the opportunities for learning and growth are second to none. From technical training to leadership programmes, we bring out the best in our people. There are plenty of opportunities to move onwards and upwards too. We’re a large, successful multinational company – and we’re still growing all the time.\n\nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential. Anglo American Platinum has a zero tolerance to dignity harms, these include all acts of gender based violence, bullying, harassment and victimisation. Ensuring the safety of our employees extends beyond physical safety and includes the eradication of harmful behaviours from our workplace. This responsibility extends to everyone at Anglo American Platinum both during work hours and outside of work. We are unconditional in creating a respectful, inclusive, and safe working environment to ensure that no colleague will be violated or harassed under our watch.\n\nHow to Apply\nThis role is open to Anglo American employees only. To apply for this role, please complete the online application. You will have the opportunity to upload your CV and other relevant documentation as part of this process.\n \nClosing Date: 12 July 2024\n \n \n \n \n ", " \n \n \n \n \nFINANCIAL ACCOUNTING ANALYST\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Finance\nLocation: Cape Town, South Africa\nReference Id: REF62403H\nExperience / Work Type: Entry Level / Permanent Employee\nClosing Date: 12 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nDe Beers Technology business\nDe Beers Technology Business have operations in both Cape Town and Johannesburg, South Africa and is part of the De Beers Group. We deliver technical services and technology systems to increase the efficiency and effectiveness of the De Beers Diamond value chain (from exploration to diamond recovery). Activities include marine geophysical survey, sampling, and mining, projects, engineering, technology development and maintenance. Projects include the establishment and development of a fleet of mining ships and all associated equipment. We provide specialized diamond processing and recovery technology for the De Beers Group Exploration and Mining Operations. We are the industry leader in marine mining practices resulting in the most successful and advanced marine mining equipment and operations globally.\n \nJob Description:\nThe Financial Accounting Analyst plays a pivotal role in the reporting of high-quality financial data. This role is responsible for:\nThe monitoring and diagnoses of financial processes that impact financial information and systems and supporting the Financial Reporting Manager in ensuring high quality data for reporting.\nFinancial data analysis and forecasting for consolidated financial planning.\nOptimization of the use of the SAP ERP system and other reporting Tools to ensure efficient and effective financial processes.\nPreparation of statutory supporting information and returns.\n \nKey responsibilities include:\nPreparation of month bi-annual and annual reporting packs adhering to IFRS Standards for Group reporting purposes.\nPreparation of cashflow forecasts and dividend calculations and reporting packs for Forecasting and Budget submissions adhering to IFRS Standards for Group reporting purposes.\nAssisting with the requirements of the annual external financial audit and the completions of the Annual Financial Statements including monitoring changes with-in the IFRS Standards and providing suggested implementation.\nManaging the Senior and Finance Clerk through management and review their day -to-day activities including the Creditor, Debtor and Cashflow processes.\nAssisting with the requirements of the annual external BBBEE audit including completion of supporting schedules and assisting the business in their quarterly reporting based on predetermined measures.\nAssisting with annual Insurance declarations and the monthly insurance adjustments to financial information.\nAssisting the Financial Reporting Manager in ensuring a Financial Reporting environment that produces accurate and valid financial information in an effective and efficient manner.\n \nQualifications:\nBCom, BRek or Business  science degree, with very good knowledge of Financial Reporting.\nA newly qualified CA (SA) will be beneficial and for the incumbent to gain corporate experience\n \nKnowledge And Experience required.\nAppropriate experience in financial accounting with a proven track record.\nWorking knowledge and understanding of reporting of information adhering to IFRS Standards.\nFinancial analysis aptitude and ability to provide quality recommendations and solutions. \nAdvanced Accounting /Systems knowledge – Excel Advanced and SAP. Working knowledge of working on Oracle systems (Eg HFM online Reporting systems).\nKnowledge of working on governmental reporting systems eg eFiling and ITAS.\nSelf-starter who can work with minimum supervision and the ability to work independently.\nAnalysis and logic, systematic and orderly planning, attention to detail.\nAbility to think creatively and take an innovative and flexible approach to problem solving in a fast-changing innovative driven company.\nAbility to work well under pressure with resilience during times of change.\n \nAdditional information:\nWho we are:\nDe Beers Group is a company with a sparkling future.\nOur experts have searched the world for nature’s most precious gem. Our diamonds bring beauty to the world. But we think they can do so much more. We want our diamonds, and our business, to make life brilliant – for our people, our customers, and the world around us.\n \nSafety\nSafety first is a way of life for us.  We are unconditional about the safety, health, and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.\n \nEquity, Diversity & Inclusion\nAs a global #HeForShe Thematic Champion, De Beers is committed to promoting an equitable, inclusive, and diverse workplace where we value and respect every colleague for who they are. We provide equality of opportunity to enable everyone to fulfil their potential. Please inform us should there be any special requirements that should be considered as part of your application.\n \nBuilding Forever\nSustainability is at the heart of our decision-making – it is how we do business.  Building Forever is key to our purpose as it represents our ambitious and holistic sustainability framework and is central to our ability to deliver long-term value to our communities and partners. This shapes how we protect our social and environmental license to operate, build a long-term legacy in our host communities and earn consumers’ trust in our diamonds that they can wear with pride.\n \nBackground Checks\nSuccessful candidates will be required to complete background screening which may include a criminal check and validation of qualifications.\n \nEligibility\nThis role is open to all individuals, and we will support employees who might need to relocate.\n \n \n \n \n ", " \n \n \n \n \nCOST ACCOUNTING ANALYST\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Finance\nLocation: Cape Town, South Africa\nReference Id: REF62792Q\nExperience / Work Type: Entry Level / Permanent Employee\nClosing Date: 12 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nDe Beers Technology business\nDe Beers Technology Business have operations in both Cape Town and Johannesburg, South Africa and is part of the De Beers Group. We deliver technical services and technology systems to increase the efficiency and effectiveness of the De Beers Diamond value chain (from exploration to diamond recovery). Activities include marine geophysical survey, sampling, and mining, projects, engineering, technology development and maintenance. Projects include the establishment and development of a fleet of mining ships and all associated equipment. We provide specialized diamond processing and recovery technology for the De Beers Group Exploration and Mining Operations. We are the industry leader in marine mining practices resulting in the most successful and advanced marine mining equipment and operations globally.\n \nJob Description:\nThe incumbent will be responsible for:\nProviding accurate cost and financial information and appropriate guidance that will assist in managing the business planning and cost analysis processes for the respective business units.\nFinancial data analysis and forecasting, formulating scenarios and providing comprehensive insight into the financial data of the respective business units.\nOptimization of the use of the SAP ERP system within the Finance department; informing financial and business decisions.\n \nKey responsibilities include:\nProviding commercial and cost management support & guidance to the Mining System Workshop business area (Paarden Eiland) and various Support Services stakeholders.\nFacilitating planning process with respective budget holders, uploading and scrutinising budget and forecast inputs aligned to scope requirements, management directives and Group guidance. Propose cost effective measures as necessary.\nAnalysing and providing commentary on variances between forecast, actuals & budget and making recommendations to management where necessary – aligned to internal reporting requirements to budget holders and Client reporting requirements. Ensuring accurate cost classification of Mining System Workshop and Support Services costs for recovery from Client.\nReviewing adequacy of cost drivers for Support Services areas aligned to the principles of Absorption Costing, propose amendments where necessary and upload required changes.\nPreparing cost reports and presentation content as required by the respective business areas and management team.\nReviewing final commercial cost close-out of the business unit for recovery from the Client in collaboration with business stakeholders and submitting accurate revenue billing requirements to Finance stakeholders timeously.\nSupporting scenario planning and financial modelling on an ad hoc basis, as and if required.\nMaintaining the projects system for the Mining System Workshop cost area whilst ensuring appropriate budget control measures are adhered to. This includes structure creation, funding management and the settlement process. Ensuring appropriate management of costs in a SAP cost centre structure including maintaining SAP assessment cycles and running assessments monthly and for cost planning purposes. Assisting with SAP related testing, as and when required.\nPerforming month end procedures on SAP including running settlements, assessments and journal postings for cost accruals and cost reallocations based on cost analysis performed.\nQualifications:\nBCom or Business  science degree, with very good knowledge of cost accounting\n \nKnowledge And Experience required:\nAppropriate experience in financial and cost accounting with a proven track record.\nWorking knowledge of Financial and Cost Management.\nFinancial analysis aptitude and ability to provide quality recommendations and solutions. \nAdvanced Accounting /Systems knowledge – Excel Advanced and SAP.\nSelf-starter who can work with minimum supervision and the ability to work independently.\nAnalysis and logic, systematic and orderly planning, attention to detail.\nAbility to think creatively and take an innovative and flexible approach to problem solving in a fast-changing innovative driven company.\nAbility to work well under pressure with resilience during times of change.\n \n \nAdditional information:\nWho we are:\nDe Beers Group is a company with a sparkling future.\nOur experts have searched the world for nature’s most precious gem. Our diamonds bring beauty to the world. But we think they can do so much more. We want our diamonds, and our business, to make life brilliant – for our people, our customers, and the world around us.\n \nSafety\nSafety first is a way of life for us.  We are unconditional about the safety, health, and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.\n \nEquity, Diversity & Inclusion\nAs a global #HeForShe Thematic Champion, De Beers is committed to promoting an equitable, inclusive, and diverse workplace where we value and respect every colleague for who they are. We provide equality of opportunity to enable everyone to fulfil their potential. Please inform us should there be any special requirements that should be considered as part of your application.\n \nBuilding Forever\nSustainability is at the heart of our decision-making – it is how we do business.  Building Forever is key to our purpose as it represents our ambitious and holistic sustainability framework and is central to our ability to deliver long-term value to our communities and partners. This shapes how we protect our social and environmental license to operate, build a long-term legacy in our host communities and earn consumers’ trust in our diamonds that they can wear with pride.\n \nBackground Checks\nSuccessful candidates will be required to complete background screening which may include a criminal check and validation of qualifications.\n \nEligibility\nThis role is open to all individuals, and we will support employees who might need to relocate.\n \n \n \n \n ", " \n \n \n \n \nTECHNOLOGY DEVELOPMENT SPECIALIST - FTC 18 MONTHS\nBusiness Unit / Group Function: Projects & Development\nDiscipline: Processing\nLocation: Johannesburg, South Africa\nReference Id: REF62593J\nExperience / Work Type: Associate / Fixed Term Employee\nClosing Date: 11 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nWe’re re-imagining mining to improve people’s lives. That includes the lives of everyone who works for Anglo American. We strive to be a great company where employees are happy, inspired to do their best work. A place where every colleague can grow, develop and realise their potential. To live up to our Always with Purpose employee value proposition, we’re putting the development and growth of colleagues first by ensuring everyone at Anglo American has the career experience they deserve.\n \nJob Description:\nThis is a fixed-term contract for 18 months and the work will be focused on laboratory, piloting and plant trials for novel flotation reagents and flotation processes.\nProvide input into the continued development of processing, circular and modular technologies through experimentation, operational tests and trials, and working with a wide range of suppliers including OEMs, consultants, academics, and technology providers.\nManage, or assist in the management of, contracts with consultants involved in studies with the IDM process; liaising closely with colleagues in the Projects function to ensure smooth transition of projects through the AA governance process.\nManage laboratory vendors through all aspects of ongoing testwork (setup, preparation, operation and data analysis)\nInput into design, demonstration and deployment of the technology at assets; particularly in the comparison of performance with existing or other emerging technologies.\nWork routinely with RDP team and ensure that models are compatible with those being used to estimate future value of the AA Group assets\nBuild and maintain effective relationships with key partners and clients: inform, influence and engage.\nBuild trust and credibility and manage relationships with internal network and external vendors and contacts to achieve business results.\nPromote an open and collaborative environment by encouraging the sharing of information and resources across boundaries.\nInput into the development of integrated mining and processing systems – in particular applying circular and modular design principles.\n \nQualifications:\nRequired: An undergraduate qualification (Bachelors / Honours degree or equivalent) in a relevant (preferably Chemical / Metallurgical Engineering) technical discipline.\nDesirable: A postgraduate qualification (Masters / Doctoral degree or equivalent) in a relevant technical discipline.\nExperience working on operating flotation circuits (PGM/ Cu), laboratory flotation test work and design of flotation experiments (PGM/ Cu flotation)\n \nTechnical Knowledge: \nOperations: \nKey value drivers within discipline's value chain and interdependence of key levers \n Project management fundamentals \nNew technologies and their impact on operational activities  \nBusiness improvement tools and techniques \nCommercial: \nBusiness acumen and commercial drivers of site performance \nBasic financial metrics, modelling & budgeting tools  \nManagement: \n Risk management techniques and critical controls \nLeadership tools for implementing a culture of purpose–led high performance and change \nCompliance: \nSafety, health and environment, legislative, statutory, regulatory and permitting requirements \n \n \nAdditional information:\nWho we are\nWe aim to lead the industry by pursuing ever safer and more responsible ways of working, demonstrating integrity and showing care and respect for people and the planet. That means we are constantly seeking new opportunities to mine and process our products sustainably, using less water, less energy and more precise extraction technologies. As the custodians of coal and other precious natural resources – diamonds (through De Beers), copper, platinum and other precious metals, iron ore and nickel – our extraordinary teams work safely and collaboratively, with the utmost consideration for local communities, our customers and the world at large.\n\nHow we are committed to your safety\nNothing is more important to us than ensuring you return home safely after a day’s work. To make that happen, we have the most rigorous safety standards in the industry. Not only that, we’re also continually investing in new technologies – from drones to data analytics – that are helping to make mining safer.\n\nInclusion and Diversity\nAnglo American is an equal opportunities employer. We are committed to promoting an inclusive and diverse workplace where we value and respect every colleague for who they are and provide equality of opportunity so that everyone can fulfil their potential.\n\nHow to apply\nTo apply for this role, please complete our online application form. You will have the opportunity to upload your CV and other relevant documentation as part of the process.\n \nAdvert Closing Date: 11 July 2024\n \n \n \n \n ", "ACCOUNTANT\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Finance\nLocation: Musina, South Africa\nReference Id: REF63072O\nExperience / Work Type: Associate / Permanent Employee \nClosing Date: 11 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nSafe. Smart. Sustainable. Probably not the first words you typically associate with mining. But De Beers is not your typical mining company. Safety first is a way of life for us.  We are unconditional about the safety, health and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.  \nWe’re the world’s leading diamond company, powered by thousands of people around the world, with a mission to support local communities, protect our natural environment and shape a brighter future. With headquarters in London and mines in four countries – Botswana, Canada, Namibia and South Africa – we are truly global.  \nWe seek talented people who share our belief in a better future for mining and are ready to make a difference.\nHere’s an exciting opportunity to join us. \n \nJob Description:\nThe purpose of the role is to apply deep technical/specialist expertise to analyse data, anticipate and diagnose problems, and provide solutions aimed at the improvement of processes, systems and work methods that meet internal and/or external stakeholder requirements through the application of sound accounting practices.\n \nYour responsibilities will include:\nEnsure sound cost management processes and perform the necessary reviews to guarantee that detailed cost management supports the overall financial governance and reporting requirements.\nImplement and advise on statutory legislation and regulations to ensure compliance.\nInfluence and ensure timeous delivery of accurate and transparent mining (both open pit and underground) related estimates, budgets, and forecasts to support the Business Plan, clearly articulating financial impacts around budget holder decision making and incorporating forward looking risks and opportunities.\nPrepare scenarios, sensitivities, forward looking risks and opportunities associated with budgets and forecasts.\nEnsure accurate and effective decision making through extraction of specific data via existing standard reports or alternatively compiling new cost reports, depending on stakeholder requirements.\nReview overall financial performance of the various BU’s through regular scheduled cost meetings and advise line managers and management on appropriate interventions to improve cost effectiveness.\nEnsure agreed Service Level Agreements (SLA’s) are met, i.e. timeous reconciliations, month end submissions, follow-up and resolving of any technical and/or general ledger related queries.\nFinalize and accumulate the financial information to adjust, close and balance financial records at period end.\nProvide financial reporting to Venetia leadership (Mining) on time and at required level of quality, adhering to Group reporting standards.\nDrive financial performance as per budget and forecasts, track delivery against plan, have clear understanding of variances, key business drivers of root causes and track actions to address challenges.\nControl and monitor processes and compliance to processes, identifying potential problems and identification of improvement opportunities.\nCoordinate preparation of all project related technical documents to ensure content and costs are within specified scope of work.\nManage and control the allocation of project funds to ensure adherence to approved budgeted expenditure.\nBe a key leader in change management that supports transformation within the team, clearly promoting cohesion, inclusivity, diversity and integration of the Venetia Underground into the Venetia Mine operational cost management business processes.\nAct as a safety leader that reinforces a workplace culture where health and safety is paramount.\n \nQualifications:\nNational Diploma or Degree in Accounting or relevant accounting qualification.\nA relevant combination of formal (Finance-related) qualifications and additional specialized studies will be advantageous\n5 years relevant experience\n \nKnowledge and Skills\nTrack record of relevant experience.\nExtensive knowledge of SAP.\nExperience in Accounting environments is preferred.\nStrong problem solving, decision making and analytical abilities.\nExperience in applying and implementing best practice principles.\nAbility to adhere to stringent deadlines.\nKnowledge and understanding of integrated systems.\n \nAdditional information:\nWho We Are:\nVenetia Mine – South Africa\nDe Beers Group is a company with a rich history and a sparkling future.\nSince 1888 our experts have searched the world for nature’s most precious gem. Our diamonds bring beauty to the world. But we think they can do so much more. We want our diamonds, and our business, to make life brilliant – for our people, our customers, and the world around us.\nVenetia Mine is part of De Beers Group Managed Operations Business which integrates mines, operations and support functions in the De Beers Group producer countries of Canada and South Africa to shape a safe, sustainable future for De Beers Group’s people, shareholders, communities and partners.\n \nSafety\nSafety first is a way of life for us.  We are unconditional about the safety, health and well-being of our colleagues, at work and at home, and about that of the communities where we work. We aim to lead the industry by investing in innovation to protect people, who are at the heart of our business. Our high performing teams take accountability for their own and others' actions, work collaboratively, and always show care and respect.\n \nBackground Checks\nBy applying for this job, you provide consent that your personal details, including your fingerprints, can be used to conduct background screening where appropriate. For more information, please visit:\n \nValues\nPut Safety First – We consider all risks to people and the environment before proceeding with any activity. We address risks before beginning any activity, even if this means stopping a task. Zero Harm is always our goal.\nBe Passionate – We are exhilarated by the product we sell, the challenges we face and the opportunities we create.\nPull Together – Being united in purpose and action, we will turn the diversity of our people, skills and experience into an unparalleled source of strength.\nBuild Trust– We will always listen first, then act with openness, honesty and integrity so that our relationships flourish\nShow we Care – The people whose lives we touch, their communities, nations and the environment we share, all matter deeply to us. We will always think through the consequences of what we do so that our contribution to the world is real, lasting and makes us proud.\nShape the Future – We will find new ways. We will set demanding targets and take both tough decisions and considered risks to achieve them. We will insist on excellent execution and reward those who deliver.\n \nEligibility Criteria \nThis role is open to all individuals and we will support employees who might need to relocate\n \nClosing date: 11 July 2024", "IM SYSTEMS MANAGER: CLIENT APPLICATIONS\nBusiness Unit / Group Function: De Beers Group\nDiscipline: Information Management\nLocation: Johannesburg, South Africa\nReference Id: REF62980O\nExperience / Work Type: Associate / Permanent Employee\nClosing Date: 09 July, 2024\n\nAPPLY\n \nOverview\nCompany Description:\nAt De Beers Group our purpose is to Make Life Brilliant.\nWe believe that a sustainable business is purposeful, competitive, resilient, and agile – it’s a business that thrives through both economic and social cycles.  By understanding the context and listening to stakeholders we stay ahead of evolving trends and provide the solutions to societal expectations.  By solving the physical challenges of mining through relentless innovation, and constantly searching for more responsible ways to do business, we are changing the way our employees and stakeholders experience our business – creating enduring value for all stakeholders. Sustainability is at the heart of our decision-making – it is how we do business.\n \nJob Description:\nThe purpose of Global Information Management (IM) is to enable the delivery of business processes, communication, collaboration and knowledge management through the deployment, support and maintenance of enterprise technology, infrastructure, applications and mine technical systems.\nThis is a tactical role conducting and managing IM demand management, support, governance, analysis, project, and vendor management services within the targeted domain. The role is a De Beers Group business leader with extensive knowledge of the client facing application landscapes. They are aligned with IM and business objectives and operating model.\nTo support the business strategy of leveraging systems to directly drive business value.\n \nKey Tasks:\nWork with business process owners and solution architect, to create and maintain a prioritized, version-controlled development roadmap for applications owned, to enable business strategy.\nPerform functional analysis, requirements definition and solution configuration and testing, in conjunction with delivery teams.\nLead and supervise development of solutions across projects and enhancements in the global solution scope.\nLead design and implementation, user documentation, data migration and reconciliation for business systems.\nDrive the adoption of best practice and enforce the use of standard systems and solutions for local solutions and applications.\nManage system demand, challenge assumptions to requirements to focus on value, establishing practicality and better ways of working.\nGain consensus and buy-in from key stakeholders on all major decisions regarding system development.\nPlan the product lifecycle, lead product release plans, and set expectations with the business on delivery.\nCoordinate activities for cloud resources to meet application demands, budget constraints, and security requirements.\nAct as the key escalation point of contact for service providers and business in problem solving and investigations related to priority 1 and 2 incident.\nWork with third party services providers to ensure that the correct service levels are achieved. Track and monitor service provider process outputs to ensure that appropriate and effective service is delivered.\nUnderstand and manage the resource requirements with 3rd party support partners, in line with budget.\nEnsure the knowledge underpinning application/service delivery is documented, managed, and maintained.\nIdentifies risk root causes and quantify potential business impact. Implements solutions to reduce level of exposure.\nResponsible for ensuring owned applications are compliant in terms of regulations and audit requirements.\nParticipate in internal and external audit engagements and ensures that IT general controls are upheld in all aspects of the solutioning and support.\nManagerial responsibility for System Support Analysts, managing work allocation, assessing performance, and supporting employee career development.\nActively participate in all business Safety, Health, and Safety initiatives\nWork safely and be committed to being a safety leader\nMust be prepared to travel and work flexible hours when required.\n \nQualifications:\nQualifications and Experience:\nAn undergraduate qualification (bachelor’s degree or equivalent) in the relevant IM discipline\nExperience working in a multinational, multi-cultural environment · IT Service Delivery, vendor management,  project management.\nBusiness case formulation, design and delivery of global enterprise solutions · Senior stakeholder engagement and management\nFunctional exposure to complex portfolio management concepts\nTeam leadership and management\nHands on experience with product development lifecycle\n4 years’ demonstrated experience as a System/Product specialist within an agile team.\n \nAdditional information:\nKnowledge and Skills:\nAbility to work across organisational and functional boundaries, with good influencing skills, excellent stakeholder, and supplier management skills, bringing people together to achieve a common goal. ·\nFinancial metrics & budgeting (performance/cost/capital management) ·\nCross-functional ERP experience · Overarching governance and quality management, ensuring compliance with data privacy and regulations ·\nNew technologies and their impact on operational activities ·\nBusiness improvement tools and techniques\nProven skills in setting individual and team goals, planning, prioritising, and administering work.\nCatalyst to delivering improvements and change.\nCapacity to learn quickly, understand complex business processes, and spot development areas.\nStrong analytical and problem-solving skills.\nA self-starter who takes the initiative and follows though ·\nUnderstands business strategies and can make the link to IM contribution ·\nUnderstands the IM Architecture and how their own work contributes to its achievement.\n \nOur Values:\nPut Safety First – We consider all risks to people and the environment before proceeding with any activity. We address risks before beginning any activity, even if this means stopping a task. Zero Harm is always our goal.\nBe Passionate – We are exhilarated by the product we sell, the challenges we face and the opportunities we create.\nPull Together – Being united in purpose and action, we will turn the diversity of our people, skills, and experience into an unparalleled source of strength.\nBuild Trust– We will always listen first, then act with openness, honesty, and integrity so that our relationships flourish.\nShow we Care – The people whose lives we touch, their communities, nations, and the environment we share, all matter deeply to us. We will always think through the consequences of what we do so that our contribution to the world is real, lasting and makes us proud.\nShape the Future – We will find new ways. We will set demanding targets and take both tough decisions and considered risks to achieve them. We will insist on excellent execution and reward those who deliver.\n \nClosing Date:  09 July 2024"], "postedDate": "8/7/2024", "iframe": "", "uuid": "p8c45784d-a7cb-48c9-817d-3ac4212906bc"}, {"imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/clicks-group-limited_orig.png", "href": "https://www.govpage.co.za/private-sector-jobs/clicks-group-limited-is-hiring5039000", "title": "CLICKS GROUP LIMITED IS HIRING", "content": [" \n \nWELLNESS ASSISTANT - CLICKS WEST STREET\nListing reference: click_017209\nListing status: Online\nApply by: 14 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Durban\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\n \nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\n\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nSTORE MANAGER - CLICKS ELSPARK\nListing reference: click_017227\nListing status: Online\nApply by: 11 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: FMCG, Retail, Wholesale and Supply Chain\nLocation: Germiston\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about retail and service excellence? Are you confident to manage a store and lead a team to deliver a competitive advantage for the brand? An exciting and challenging opportunity has become available for a Store Manager. The successful individual will report to the Area Manager.\n \nJob description\n \nJob Purpose:\nTo ensure the efficient operation of the store and service excellence by leading and directing the store operations team in order to meet sales, profit and compliance targets, leading to a competitive advantage for the brand. \n \nJob Objectives:\nTo ensure the achievement of the stores financial performance by driving and maximising sales, tracking daily targets, weekly and monthly sales plans and proactively taking appropriate action as required.\nTo efficiently manage and control all operational activities of the store, including expenses, stock management, shrinkage, general housekeeping and administration.\nTo successfully manage in-store execution of all visual merchandising, ensuring that in-store presentation and promotional standards are maintained and that the appearance of the store is in line with the brand image.\nTo ensure competent and motivated employees through effective selection, leadership, management and on-going development in order to build capacity and capability to meet current and future business needs.\nTo adequately schedule staff in line with the Group's labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed.\nTo ensure all administrative responsibilities are attended to in an efficient manner, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo execute customer service initiatives in store and take corrective action that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo maintain an awareness of customer trends, demographics and needs and monitor the activity of local competitors in order to capitalise on opportunities.\nTo drive cohesion, consistency and integration between the store operation, pharmacy and clinic teams.\nTo drive a high performing business culture that delivers employee affiliation, customer satisfaction and shareholder value.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\n \nEducation and Experience Requirements:\nEssential: Grade 12 (Maths 50% and English 50%)\nEssential: B. Degree or Diploma in retail / finance management, pharmacy or related (External applicants)\nMinimum 2 years’ experience in a store management role within a retail/FMCG store operations environment or successful completion the Clicks Trainee Store Management Programme\nFinancial management experience (budgets, profit and loss statements, financial ratios, etc.)\n \nJob Knowledge and Skills Required:\nSound understanding and application of financial management principles\nStrong retail/FMCG background and understanding of merchandising and promotions principles\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of Customer service excellence\nKnowledge of labour legislation and IR practices \nKnowledge of competency based interviewing\nSound managerial skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nLeading and Supervising\nPlanning and Organising\nDelivering Results and Meeting Customer Expectations\nEntrepreneurial and Commercial Thinking\nDeciding and Initiating Action\nWorking with people\nAnalysing\nCoping with Pressures and Setbacks\n \nContractual Hours:\n45hrs 6days\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nTECHNICAL COMPLIANCE OFFICER\nListing reference: click_017233\nListing status: Online\nApply by: 10 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Merchandising\nLocation: Cape Town\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nWe are looking to recruit a Technical Compliance Officer to work within our Private Label Department. The role will be based at the head office in Cape Town and report to the Technical Manager.\n \nJob description\n \nJob Purpose:\nTo set up, implement and manage the Clicks Private Label Audit Process aligned to international quality, labour, health & safety, management, environment and ethical standards.\n \nJob Objectives:\nTo work with an approved independent auditing house to set up the required audit standards aligned to international standards and internal policies.\nSet up the audit life cycle and workshop with internal stakeholders to prioritise nigh risk and high value\nsuppliers.\nManage cost negotiations and budgets.\nTo implement and manage the audit life cycle.\nCommunicate all requirements with external stakeholders and report timeously and consistently to internal stakeholders.\nTo utilise information to score card suppliers to highlight risk with a corrective action plan.\nTo analyse reports and implement corrective action.\nTo resolve technical issues that arise and conduct post implementation monitoring.\nTo create handover support documentation to ensure sustainability\nTo maintain documentation and version control to manage all documentation for full traceability.\nTo manage Sedex membership, increase Supplier membership and utilise the portal to manage, track and\nreport risk.\nTo implement BSCI membership, increase Supplier membership and utilise the portal to manage, track and report risk.\nTo eventually implement Responsible Palm Oil across recognized suppliers.\n \nMinimum requirements\n \nEducation:\nDegree or Diploma in Quality Assurance, Btech Technology, Food Technology and or associated science graduate.\nISO and/or FSSC audit certification\n \nJob Experience:\n3 years or more experience\n \nJob Skills and Knowledge:\nRelevant quality and auditing qualifications\nProject management\nKnowledge of ISO, GMP. GLP, HACCP requirements\nExperienced in compiling and managing documentation\nEthical\nGood troubleshooting skills\nReport writing\nProject management\nComputer literate\nKnowledge of standards and procedures\nBe comfortable writing technical documentation\nCommunication skills\nAttention to detail\nStandards driven\nProblem solving skills\nStatistical analysis\n \nCompetencies:\nDeciding and Initiating Action\nWorking with People\nAdapting and Responding to Change\nFollowing Instructions and Procedures\nAdhering to Principle and Values\nCoping with Pressures and Setbacks\nWriting and Reporting\nApplying Expertise and Technology\nAnalysing\nPresenting and Communicating Information\nLearning and Researching\nDelivering Results & Meeting Customer Expectations\nPlanning and Organising\nEntrepreneurial and Commercial Thinking\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nQUALIFIED POST BASIC PHARMACIST ASSISTANT - CLICKS DAINFERN SQUARE\nListing reference: click_017235\nListing status: Online\nApply by: 10 July 2024\nPosition summary\nIndustry: Pharmaceutical Sector\nJob category: Dispensing/Pharmacy\nLocation: Fourways\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nResponsible for providing pharmaceutical care services (within scope of practice) and performing day-to-day dispensary administration according to company's Standard Operating Plans (SOPs).\n \nJob description\n \nJob Objectives:\nHigh standards of customer service and care\nEfficient stock control and administration, including repacking of medicine\nEfficient dispensary administration\nAccurate compounding\nProvision of general health advice\nHigh standards of housekeeping and merchandise display\nAd hoc requirements as per operational requirements\n \nMinimum requirements\n \nQualifications and Experience:\nMatric with Maths (Essential)\nMinimum requirements of the Health Professions Council of South Africa for the various levels as a Pharmacist Assistant (Qualified, Post Basic and Learner Basic)\n \nSkills, Abilities and Job Related Knowledge: \nProduct knowledge (Health isle and OTC)\nSAPC and relevant legal knowledge\nCustomer service orientated\nTeam Player\nIntegrity\nEthical working practice and compliance\nAccuracy and attention to detail\nBasic calculations\nIT Business Operating Systems\nMS Office\n \nCompetencies: \nAdhering to Principles and Values\nWorking with People\nDelivering Results and Meeting Customer Expectations\nFollowing Instructions and Procedures\nRelating and Networking\nPlanning and Organising\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nWe are committed to the principles of Employment Equity\nAPPLY\n \n \n \n ", " \n \n \n \n \nSTORE MANAGER - CLICKS HEIDEDAL\nListing reference: click_017219\nListing status: Online\nApply by: 10 July 2024\nPosition summary\nIndustry: FMCG & Supply Management\nJob category: Other: FMCG, Retail, Wholesale and Supply Chain\nLocation: Bloemfontein\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about retail and service excellence? Are you confident to manage a store and lead a team to deliver a competitive advantage for the brand? An exciting and challenging opportunity has become available for a Store Manager. The successful individual will report to the Area Manager.\n \nJob description\n \nJob Purpose:\nTo ensure the efficient operation of the store and service excellence by leading and directing the store operations team in order to meet sales, profit and compliance targets, leading to a competitive advantage for the brand. \n \nJob Objectives:\nTo ensure the achievement of the stores financial performance by driving and maximising sales, tracking daily targets, weekly and monthly sales plans and proactively taking appropriate action as required.\nTo efficiently manage and control all operational activities of the store, including expenses, stock management, shrinkage, general housekeeping and administration.\nTo successfully manage in-store execution of all visual merchandising, ensuring that in-store presentation and promotional standards are maintained and that the appearance of the store is in line with the brand image.\nTo ensure competent and motivated employees through effective selection, leadership, management and on-going development in order to build capacity and capability to meet current and future business needs.\nTo adequately schedule staff in line with the Group's labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed.\nTo ensure all administrative responsibilities are attended to in an efficient manner, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo execute customer service initiatives in store and take corrective action that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo maintain an awareness of customer trends, demographics and needs and monitor the activity of local competitors in order to capitalise on opportunities.\nTo drive cohesion, consistency and integration between the store operation, pharmacy and clinic teams.\nTo drive a high performing business culture that delivers employee affiliation, customer satisfaction and shareholder value.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\n \nEducation and Experience Requirements:\nEssential: Grade 12 (Maths 50% and English 50%)\nEssential: B. Degree or Diploma in retail / finance management, pharmacy or related (External applicants)\nMinimum 2 years’ experience in a store management role within a retail/FMCG store operations environment or successful completion the Clicks Trainee Store Management Programme\nFinancial management experience (budgets, profit and loss statements, financial ratios, etc.)\n \nJob Knowledge and Skills Required:\nSound understanding and application of financial management principles\nStrong retail/FMCG background and understanding of merchandising and promotions principles\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of Customer service excellence\nKnowledge of labour legislation and IR practices \nKnowledge of competency based interviewing\nSound managerial skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nLeading and Supervising\nPlanning and Organising\nDelivering Results and Meeting Customer Expectations\nEntrepreneurial and Commercial Thinking\nDeciding and Initiating Action\nWorking with people\nAnalysing\nCoping with Pressures and Setbacks\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nSENIOR PACKAGING DESIGNER\nListing reference: click_017179\nListing status: Online\nApply by: 10 July 2024\nPosition summary\nIndustry: Advertising, Communication & PR\nJob category: Packaging\nLocation: Western Cape\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nWe are looking for a Retail focused, Senior designer to join our Packaging design team. Experience in packaging design is a must and solid agency experience is required.\n \nJob description\n• To deliver world-class Packaging designs across the Clicks brands by delivering the best creative solutions to support the achievement of Clicks Private label ranges and financial targets.\n• To deliver and land newness and innovation for Clicks Private Label packaging in alignment with all critical paths.\n• To develop brand-consistent packaging inline with all Clicks CI Guidelines.\n• To conceptualise and execute high-priority projects across multiple brands.\n• To understand marketing trends and have the ability to translate these into creative solutions for our brands to ensure competitor standout.\n• To work closely and collaboratively within the team supporting the Packaging Manager, Account Managers, designers and Clients to ensure a smooth workflow and delivery of work while ensuring the creative brief are met.\n• To be aligned with the status of work in progress at all times to ensure deadlines are met and manage own timelines. • To presentation, all creative artwork making sure work maintains an excellent level of quality and design.\n• To mentor junior designers and DTP to ensure timeous delivery and correct interpretation of creative briefs/projects.\n \nMinimum requirements\nEducation\n• Packaging Design qualification from a recognized institution (Degree or diploma) or proven working track record in the Retail design field specifically in the Brand and Packaging field. \n \nJob-Related Knowledge\n• Solid understanding of industry print/technical standards\n• Strong conceptual/Design skills and Style\n• Ability to do 3D mockups/renders for presentations\n• Mac Literate, as well as technical knowledge and proficiency of design software essential (Latest Adobe Creative Suite: Illustrator, InDesign, Photoshop).\n \nJob-Related Skills:\n• Photo retouching & editing – would be advantageous\n• Organised and with excellent attention to detail and a methodical approach to assignments is essential.\n• Excellent time management, Ability to multitask and work well under pressure\n• Good written and verbal Communication Skills\n• Team player\n• Positive can-do attitude\n• Willing to be a team player and put in the extra effort\n \nJob-Related Experience:\n• At least 5 years packaging and brand design experience with an outstanding working knowledge of concept artwork, finished Art and all print & packaging processes.\n• At least 6 years’ graphic design experience in Brand & Packaging design\n• Must have experience in developing Brands conceptually as well as the ability to carry concept through to finished art.\n• Experience designing and rollout of all Packaging Design materials.\n \nCompetencies:\n• Deciding and initiating action\n• Applying expertise and technology\n• Presenting and communicating information\n• Creation and innovation\n• Delivering results & meeting customer expectations\n• Adapting and responding to change\n• Coping with pressure and setbacks\n• Achieving personal work goals and objectives\n \nWhy Clicks;\nWe look for customer-obsessed people with a “can do” attitude, that are professional and passion about their Careers.\nClicks Groups employee value proposition focuses on people, passion and opportunities. We care about and contribute to the well-being of people, the environment and communities, while the group’s growth strategy provides our people with unlimited opportunities.\nWe endeavour to provide feedback to all candidates whenever possible, however, if you don't hear from us in 2 – 4 weeks, please consider your application unsuccessful.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nMID-WEIGHT DTP OPERATOR (LAYOUT ARTIST)\nListing reference: click_017185\nListing status: Online\nApply by: 10 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: DTP / Graphic\nLocation: Cape Town\nContract: Permanent\nRemuneration: Market Related\nEE position: No\n \nIntroduction\nPosition available for a skilled layout artist / DTP operator to work for one of South Africa's most loved brands.\n \nJob description\n \nDuties & Responsibilities\nInterpreting of briefs to the brief objectives. \nLayout and design leaflets and POS from inception to completion.\nEnsure consistency of all Layout and design material to brand guidelines.\nMeticulous attention to detail & ability to problem solve in a challenging retail environment.\nWork closely with creative team to develop effective marketing communications.\nEfficiently manage and check own artwork.\nProvide support to line manager.\n \nMinimum Requirements\n \nQualifications and Experience:\nAppropriate Degree or qualification in Desk Top Publishing\n3– 5 years experience in DTP/Layout Artist role within a reputable agency\nStrong layout skills - Essential\nFast, efficient and accurate - Essential\nMultitask and deadline driven\nManage self and work within a team\nProficient in Adobe Creative Cloud (InDesign, Illustrator & Photoshop)\nRetouching ability – Advantageous\nPrevious Retail/Catalogue/Magazine layout experience - Essential\n \nEssential Competencies\nApplying Expertise and Technology\nCreating and Innovating\nDelivering Results and Meeting Customer Expectations\nPersuading and Influencing\nPresenting and Communicating Information\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nQUALIFIED POST BASIC PHARMACIST ASSISTANT - CLICKS BT NGEBS\nListing reference: click_017234\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Pharmaceutic\nLocation: Eastern Cape\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nResponsible for providing pharmaceutical care services (within scope of practice) and performing day-to-day dispensary administration according to company's Standard Operating Plans (SOPs).\n \nJob description\n \nJob Objectives:\nHigh standards of customer service and care\nEfficient stock control and administration, including repacking of medicine\nEfficient dispensary administration\nAccurate compounding\nProvision of general health advice\nHigh standards of housekeeping and merchandise display\nAd hoc requirements as per operational requirements\n \nMinimum requirements\n \nQualifications and Experience:\nMatric with Maths (Essential)\nMinimum requirements of the Health Professions Council of South Africa for the various levels as a Pharmacist Assistant (Qualified, Post Basic and Learner Basic)\n \nSkills, Abilities and Job Related Knowledge: \nProduct knowledge (Health isle and OTC)\nSAPC and relevant legal knowledge\nCustomer service orientated\nTeam Player\nIntegrity\nEthical working practice and compliance\nAccuracy and attention to detail\nBasic calculations\nIT Business Operating Systems\nMS Office\n \nCompetencies: \nAdhering to Principles and Values\nWorking with People\nDelivering Results and Meeting Customer Expectations\nFollowing Instructions and Procedures\nRelating and Networking\nPlanning and Organising\n \nContractual Hours\n45 Hours/ 6 days\n \nKindly note only applicants who meet the minimum requirements will be contacted. We are committed to the principles of Employment Equity\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nBEAUTY ADVISOR - CLICKS MOUNTAIN VIEW\nListing reference: click_017218\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about beauty products and helping people look and feel good? Are you confident to engage and communicate your knowledge of our beauty products with our customers? We have exciting opportunities in Clicks' stores for Beauty Assistant who will report to the Store Manager, service the entire beauty dept.\n \nJob description\n \nJob Purpose:\nTo deliver service excellence through the provision of professional and knowledgeable advice on beauty and skincare products, the promotion and effective management of merchandise and general housekeeping in order to build customer loyalty and maximise sales.\n \nJob Objectives:\nTo consult with customers, answer product based questions and advise customers in selecting the best products and services that meet their needs.\nTo drive and maximise sales of the beauty department through the promotion, cross-selling and up-selling in order to ensure that monthly targets are consistently met.\nTo monitor sales, regularly evaluate the performance of products and offer suggestions that results in improved product offerings and increased sales.\nTo maintain updated knowledge on all beauty products, ranges, trends, promotions and events in order to provide the correct information to customers at all times.\nTo efficiently execute all operational activities within the beauty department, including effective stock management, minimising shrinkage and ensuring a high standard of general housekeeping and administration.\nTo ensure all in-store visual merchandising, in-store presentation and promotional standards within the beauty department are consistently met.\nTo deliver superior customer service by acting as a brand ambassador, being visible and offering a friendly and professional service.\nTo promote the Clicks clubcard and to enroll new clubcard members in order to achieve the clubcard participation targets.\nTo increase profitability and brand loyalty with the customers through the promotion of private label and exclusive products.\nTo facilitate the brand being the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\n \nQualifications and Experience:\nEssential: Grade 12\nDesirable: Relevant Beauty/skincare qualification\nDesirable: Experience within beauty / skincare / retail / FMCG environment / sales or marketing environment\n \nSkills, Abilities and Job Related Knowledge:\nUnderstanding and application of selling principles\nRetail/FMCG background and understanding of merchandising and promotions principles\nUnderstanding of stock management procedures\nKnowledge of customer service excellence\nKnowledge of beauty and skincare products\nResults and target driven\nStrong customer orientation\nGood communication skills\nInterpersonal skills\nEngaging and confident\n \nCompetencies:\nPersuading and influencing\nRelating and Networking\nDelivering Results and Meeting Customer Expectations\nCommercial Thinking\nFollowing instructions and procedures\nWorking with people\nPlanning and organising\nCoping with Pressures and Setbacks\n \nContractual Hours:\n27- 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nWe are committed to the principles of Employment Equity\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nFACILITIES SUPERVISOR - COPY\nListing reference: click_017222\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: FMCG & Supply Management\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Centurion\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAn exciting Facilities Superviso opportunity for overseeing the maintenance , operation of buildings, equipment, coordinate repairs, enforce safety measures, and manage a team of maintenance personne based at Centurion Distribution Centre. The role will report directly to the Facilities Manager.\n \nJob description\n \nJob Purpose: Effectively manage company assets. Provide a safe working environment at all sites. To control & manage all contractors/service providers service delivery, financial and contract compliance. This relates to the Centurion Distribution Centre.\n \nJob Objectives:\n·          Effective management of Facilities, Contractors & Service Provider Staff and all resources and aspects relating to these departments at Centurion DC site\n·          Assist with the implementation of complete safety policies and committees in accordance with OHSAct\n·          Building and maintaining of process and procedures of each role within the department\n·          Ensure that facility is properly maintained and repaired on an ongoing basis\n·          Implement and maintain safety and security protocols to protect the facility and its occupants, including fire safety,emergancy preparedness and access control\n·          To ensure that Stakeholder communication is done effectively, internally and externally\n·          To implement a pro-active land and building maintenance program\n·          Ensure accurate and up to date Databases are maintained Continuous improvement of the data captured, stored and reported\n·        Administration & Management of the Facilities and 4Me for services & facilities; in order to provide management with effective and accurate reporting\n·          Effective management and training of the staff\n·          KPA’s to be completed for all staff timeously, with indicated needs for training and development, performance management\n·          Ensure professional and efficient customer contact\n·          Provide monthly reports to the Department Head\n·          Cost Centre accountability and management\n \nMinimum requirements\n Qualifications and Experience:                                         \n·          Grade 12\n·          Tertiary Education in a similar field.\n·          Min 5 years experience in a Junior/managerial position.\n·          5 Years experience in a Facilities Management Environment \n \nSkills, Abilities and Job Related Knowledge:\nHigh Level of:\n·          Drafting and Implementing SLA,s Policies & Procedures\n·          People Management\n·          Ability to interact at all levels\n·          Problem solving &decision making\n \nEssential Competencies:\n·        Leading and Deciding\n·        Interacting and Presenting\n·        Quick and efficient identifying and solving problems\n·        Analyzing and Interpreting, Organizing and Executing\n·        Set and achieve deadlines\n·        Adapting and Coping, able to work under pressure\n·        High sense of urgency\n·        Attention to detail\n·        Flexible and energetic\n·        Must be able to work under pressure\n·        Must be honest, responsible and self-motivated\n·        Must be approachable, friendly, helpful and polite\n·        Able to work independently, reliable\n·        Able to multi task\n·        Resilient\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nPHARMACY MANAGER - MFULENI\nListing reference: click_017229\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Pharmaceutic\nLocation: Cape Town\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo ensure the efficient operation of the dispensary and the clinic and to ensure service excellence by leading and directing the pharmacy team to deliver high standards of Pharmaceutical care in order to meet sales and compliance targets, leading to a competitive advantage for the brand.\n \nJob description\n \nJob Objectives:\nTo ensure and to provide high standards of pharmaceutical care, accurate and safe dispensing, including generic substitution, and the provision of advice in accordance with Clicks’ way of working, good pharmacy practice and within the legal scope of practice as outlined by the South African Pharmacy Council (SAPC).\nTo efficiently manage and control all operational activities of the dispensary, including safe and responsible stock management, shrinkage, general housekeeping and administration in line with merchandising, SAPC regulations and company standards.\nTo ensure the operational viability of the dispensary through sound financial management, focus on core dispensary and clinic targets, management of expenses and proactively taking appropriate action as required.\nTo ensure competent and motivated employees, including learners and interns, through effective selection, leadership, management and on-going development in order to build capacity and capability to meet current and future business needs.\nTo adequately schedule staff in line with the labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo manage customer service initiatives in the dispensary that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo ensure integration and partnership with the clinic and healthcare ailse resulting in a full offering to customers regarding their healthcare needs.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\nTo drive cohesion, consistency and integration between the store operation, pharmacy and clinic teams.\nTo drive a high performing business culture that delivers employee affiliation, customer satisfaction and shareholder value.\n \nKnowledge:\nSAPC and relevant legal knowledge\nEthical working practice and compliance\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of patient care, professional counselling\nKnowledge of customer service excellence\nKnowledge of labour legislation and IR practices \nSound understanding and application of financial management principles\nKnowledge of competency based interviewing\n \nSkills:\nSound managerial, tutorship and coaching skills\nResults and target driven\nPlanning and organizing skills\nProblem-solving skills\nStrong customer orientation\nInterpersonal skills (Customer service orientation and effective patient care)\nComputer literacy\nStrong financial acumen\n \nCompetencies:\nEssential:\nLeading and Supervising\nDelivering Results and Meeting Customer Expectations\nPlanning and Organizing\n \nDesirable:\nRelating and networking\nCoping with Pressures and Setbacks\nEntrepreneurial and Commercial Thinking\nWorking with people\nAdhering to Principles and Values\n \nMinimum requirements\nExperience:\nEssential: Minimum 2 years’ experience post community service year\nEssential: Minimum 1 year People Management experience\nEssential: Registration as Responsible Pharmacist with SAPC\nDesirable: Retail Pharmacy experience\nDesirable: Unisolve experience\n \nEducation:\nEssential: Registered Pharmacist with SAPC\n \nAPPLY\n \n \n \n ", " \n \n \n \n \nSTORE MANAGER - EASTWOOD VILLAGE\nListing reference: click_017231\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: FMCG & Supply Management\nJob category: Other: FMCG, Retail, Wholesale and Supply Chain\nLocation: Gauteng\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about retail and service excellence? Are you confident to manage a store and lead a team to deliver a competitive advantage for the brand? An exciting and challenging opportunity has become available for a Store Manager. The successful individual will report to the Area Manager.\n \nJob description\n \nJob Purpose:\nTo ensure the efficient operation of the store and service excellence by leading and directing the store operations team in order to meet sales, profit and compliance targets, leading to a competitive advantage for the brand.  \n \nJob Objectives:\nTo ensure the achievement of the stores financial performance by driving and maximising sales, tracking daily targets, weekly and monthly sales plans and proactively taking appropriate action as required.\nTo efficiently manage and control all operational activities of the store, including expenses, stock management, shrinkage, general housekeeping and administration.\nTo successfully manage in-store execution of all visual merchandising, ensuring that in-store presentation and promotional standards are maintained and that the appearance of the store is in line with the brand image.\nTo ensure competent and motivated employees through effective selection, leadership, management and on-going development in order to build capacity and capability to meet current and future business needs.\nTo adequately schedule staff in line with the Group's labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed.\nTo ensure all administrative responsibilities are attended to in an efficient manner, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo execute customer service initiatives in store and take corrective action that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo maintain an awareness of customer trends, demographics and needs and monitor the activity of local competitors in order to capitalise on opportunities.\nTo drive cohesion, consistency and integration between the store operation, pharmacy and clinic teams.\nTo drive a high performing business culture that delivers employee affiliation, customer satisfaction and shareholder value.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Grade 12 (Maths 50% and English 50%)\nEssential: B. Degree or Diploma in retail / finance management, pharmacy or related (External applicants)\nMinimum 2 years’ experience in a store management role within a retail/FMCG store operations environment or successful completion the Clicks Trainee Store Management Programme\nFinancial management experience (budgets, profit and loss statements, financial ratios, etc.)\n \nJob Knowledge and Skills Required:\nSound understanding and application of financial management principles\nStrong retail/FMCG background and understanding of merchandising and promotions principles\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of Customer service excellence\nKnowledge of labour legislation and IR practices \nKnowledge of competency based interviewing\nSound managerial skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nLeading and Supervising\nPlanning and Organising\nDelivering Results and Meeting Customer Expectations\nEntrepreneurial and Commercial Thinking\nDeciding and Initiating Action\nWorking with people\nAnalysing\nCoping with Pressures and Setbacks\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan.  We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nSHOP ASSISTANT CASHIER - CLICKS BREDASDORP (WESTERN CAPE)\nListing reference: click_017237\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Bredasdorp\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo deliver service excellence through efficient customer service, point of sale (POS) operational activities and merchandising in store that leads to a positive customer experience.\n \nJob description\n \nJob Objectives:\nTo efficiently execute all operational activities at the point of sale in a timely and efficient manner.\nTo maintain high levels of accuracy when scanning merchandise and collecting payment for goods purchased, including actioning clubcard rewards.\nTo ensure the safe handling of cash at all times.\nTo proactively promote the Clicks' clubcard and to enroll new clubcard members in order to achieve the clubcard participation targets.\nTo make customers aware of promotions in order to positively affect sales and to ensure customers \"feel good and pay less\".\nTo deliver superior customer service by acting as a brand ambassador, being visible and offering a friendly and professional service.\nTo efficiently execute and maintain all merchandising and general housekeeping duties according to store and visual merchandise standards.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\nTo maintain updated knowledge on products, ranges, promotions and events in order to provide the correct information to customers at all times.\n \nKnowledge:\nBasic maths calculations\nRetail/FMCG background and understanding of merchandising and promotions principles\nUnderstanding of stock management procedures \nKnowledge of customer service excellence\n \nSkills:\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\nNumeracy skills\n \nCompetencies:\nEssential:\nRelating and networking\nFollowing instructions and procedures\nDelivering Results and Meeting Customer Expectations\n \nDesirable:\nWorking with people\nPersuading and Influencing\nPlanning and Organising\nCoping with Pressures and Setbacks\n \nMinimum requirements\nExperience:\nDesirable: experience in a customer facing role within a retail/FMCG store operations environment\n \nEducation:\nEssential: Grade 12\nDesirable: Maths 50% and English 50% at Grade 12 level\n \nPlease email CV to: CLK1840MGR@clicks.co.za\n \n \n \n \n ", " \n \n \n \n \nPHARMACIST ASSISTANT QPB - WELLINGTON\nListing reference: click_017238\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: Pharmaceutical Sector\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Paarl\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nResponsible for providing pharmaceutical care services (within scope of practice) and performing day-to-day dispensary administration according to company's Standard Operating Plans (SOPs). To focus on the administration of scripts to provide general dispensing duties with the emphasis on patient satisfaction\n \nJob description\n \nJob Objectives:\n \nResponsibilities\n·       Interact with customers in a professional manner and with strict confidentiality within SOP and agreed timelines\n·       Administration of scripts and or any other claiming/capturing related procedure\n·       Accurate and complete handling of all profiles worked on\n·       Interact with health care professionals where needed\n·       Problem solving and follow up of queries\n \nDuties\n·       Interact with customers via telephone or other means regarding medication and Healthcare Services\n·       Accurate capturing of scripts received at the Central Pharmacy centre\n·       Handling of queries regarding prescriptions\n·       Patient Profile management\n·       Assist with Chronic authorizations\n·       Liaison with all other departments\n·       Ad hoc requirements as per operational requirements\n \nKnowledge:\n·       Product knowledge (including OTC)\n·       SAPC and relevant legal knowledge\n·       Sound knowledge of the chronic authorization process and procedures\n·       Customer service orientated\n·       Ethical working practice and compliance\n \nSkills:\n·       Computer literacy (MS Office)\n·       Customer service orientated\n·       Team Player\n·       Integrity\n·       Accuracy and attention to detail\n·       Computer literacy (MS Office)\n·       Must be bilingual (with English being one of the requirements\n·       Must be able to work with patients and be adaptable to assist with various departmental duties\n·       Be able to use initiative in order to provide patient satisfaction\n·       Effective time management skills\n·       Adaptability\n·       Positive attitude\n·       Be able to work under pressure\n \nCompetencies:\n \nEssential\n·       Adhering to Principles and Values\n·       Working with People\nDelivering Results and Meeting Customer Expectations\n \nMinimum requirements\nExperience:\n·       Minimum 1 year in the role of Pharmacist Assistant Post Basic\n \nEducation:\n·       Further Education and Training Certificate Pharmacist Assistance (Essential)\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \n \nSALES ADVISOR - CLICKS BLUE ROUTE MALL\nListing reference: click_017236\nListing status: Online\nApply by: 9 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Retail Operations\nLocation: Cape Town\nContract: Fixed Term Contract\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about beauty products and helping people look and feel good? Are you confident to engage and communicate your knowledge of our The Body Shop products with our customers? We have exciting opportunity in Clicks' stores for Sales Advisors.\n \nJob description\n \nJob Purpose:\nTo deliver service excellence through the provision of professional and knowledgeable advice on beauty and skincare products, the promotion and effective management of merchandise and general housekeeping in order to build customer loyalty and maximize sales.\n \nJob Objectives:\n To achieve high levels of customer satisfaction through being visible, being knowledgeable and customer focused.\n To increase customer loyalty through promoting Make overs and skin consultations within store.\n To achieve Body Shop sales goals by engaging with the customer and providing personalized customer service at all times.\nTo monitor and improve/increase stock availability by following stock management processes i.e. actioning weekly counts, zero low stocks.\n To maintain high levels of store standards through daily housekeeping and merchandising principles.\n To prevent shrinkage and loss by being accurate, honest and vigilant in all job duties.\nTo assist with in-store training and coaching related to the make-up and skin care categories by sharing information within store related to techniques, trends and diagnostic tools.\n To assist with in-store training and coaching related to the make-up and skin care categories by sharing information within store related to techniques, trends and diagnostic tools.\n \nMinimum requirements\nQualifications and Experience: \n Matric/Grade 12 (Essential)\n Diploma in Make-up and/or Skincare (Desirable)\n Experience working in a customer service environment with both sales and service target’s (Essential)\n Related work experience in make-up and skincare (Desirable))\n \nSkills, Abilities and Job Related Knowledge: \n Basic Computer Literacy\n Basic retail industry principles\n Selling skills\n Interacting with customers\nStock Management principles\n Communication skills\n Accuracy\n Interpersonal skills\n Good literacy and numeracy\nAbility to speak English and preferably one other official language\n \nCompetencies:\nDelivering Results and Meeting Customer Expectations\nApplying Expertise and Knowledge\nRelating and Networking\nCoping with Pressures and Setbacks\n Working with People\nAdhering to Principles and Values\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nWe are committed to the principles of Employment Equity\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nASSISTANT STORE MANAGER- CLICKS RIVERSIDE BOULEVARD\nListing reference: click_017202\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Retail Operations\nLocation: Gauteng\nContract: Permanent\nRemuneration: Market Related\nEE position: No\n \nIntroduction\nAre you passionate about retail and service excellence? Are you confident to drive sales and build customer loyalty in order to ensure a competitive advantage for the brand? An exciting and challenging opportunity has become available for an Assistant Store Manager. The successful individual will report to the Store Manager.\n \nJob description\nJob Purpose:\nTo support the Store Manager in ensuring the efficient operation of the store and service excellence by driving sales and building customer loyalty in order to meet sales, profit and compliance targets, leading to a competitive advantage for the brand.\n \nJob Objectives:\nTo ensure the achievement of the stores financial performance by driving and maximising sales through the execution of promotional activities and driving cross-selling, up-selling initiatives and superior customer service across the store team.\nTo efficiently execute all operational activities of the store, including expenses, stock management, shrinkage, general housekeeping and administration.\nTo successfully execute in-store visual merchandising, ensuring the in-store presentation and promotional standards are met and that the appearance of the store is in line with the brand image.\nTo support the Store Manager in ensuring staff are motivated and directed to achieve their targets and performance goals and effectively managed in the absence of the store manager.\nTo assist the Store Manager in maintaining the work schedule on a daily basis in line with the Group's labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed.\nTo execute customer service initiatives in store that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo attend to all administrative responsibilities in an efficient manner, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Grade 12 (Maths 50% and English 50%)\nEssential: Relevant Retail/Business Management qualification (External applicants)\nDesirable: Degree in Relevant Retail/Business Management\nMinimum 2 years’ experience in an assistant store management role within a retail/FMCG store operations environment or successful completion the Clicks Trainee Store Management Programme\nFinancial management experience (budgets, profit and loss statements, financial ratios, etc.)\n \nJob Knowledge and Skills Required:\nUnderstanding and application of financial management principles\nRetail/FMCG background and understanding of merchandising and promotions principles\nKnowledge of stock, cost, risk and compliance management procedures\nKnowledge of customer service excellence\nKnowledge of labour legislation and IR practices\nKnowledge of people management\nKnowledge of competency based interviewing\nNumeracy skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\n \nEssential Competencies\nFollowing instructions and procedures\nPlanning and Organising\nDelivering Results and Meeting Customer Expectations\nWorking with people\nAnalysing\nLeading and Supervising\nEntrepreneurial and Commercial Thinking\nCoping with Pressures and Setbacks\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nWe are committed to the principles of Employment Equity.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nPICKING SUPERVISOR CENTURION DC 103\nListing reference: click_017221\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Distribution, Transport & Logistics\nJob category: Distribution\nLocation: Centurion\nContract: Permanent\nRemuneration: Market related\nEE position: No\n \nIntroduction\nAn exciting opportunity as DC Supervisor Picking has become available at New Clicks SA (Pty) Ltd. The role will be based in Centurion DC and will report to the Departmental Manager.\n \nJob description\nPurpose and Objectives\nYou will be responsible to effectively manage a team ensuring adherence to policies and processes and meeting of productivity targets, within a multi-disciplined environment.\nTo hold the daily SGM meetings, address performance and training needs to ensure improvement.\nTo manage employees to achieve productivity targets and take remedial action where required.\nTo assist in planning for staff requirements based on volume, aligned to planned budget.\nTo action and manage daily/weekly reporting\nTo adhere to statutory health and safety requirements, housekeeping standards and all other internal policies to ensure compliance.\nEnsure that the KPI board is completed correctly and timeously.\nTo achieve the KPI’s in the department within planned budgets and schedules and ensure a proper handover between shifts.\nTo ultimately deliver high levels of service to Our Customers.\nTo live and instil The Brand’s Values.\n \nMinimum requirements\nExperience and Education:\nMatric/NQF Level 4 (Essential)\nRelevant Tertiary Qualifications (Advantageous)\n3 years’ experience in a logistic environment (Essential)\nJob related knowledge and skills:\n \nPreferred skills\nComputer skills on MS Office (Word and Excel)\nWM Systems understanding\nFinancial background- Budget and Cost Management\nUnderstanding of handling IR related issues\nUnderstanding of Housekeeping & the 5S’s approach\nUnderstanding of Health & Safety requirements\n \nCompetencies required:\nCommunicate effectively at all levels\nExcellent negotiating skills\nStrong planning and co-coordinating skills\nAbility to work in a team\nAbility to work under pressure / time deadlines\nHonesty and integrity\nAttention to detail\nAbility to manage a Team\nAbility to manage performance\nAbility to plan and execute within a short space of time\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nPHARMACIST - CLICKS VAALGATE\nListing reference: click_017201\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Dispensing/Pharmacy\nLocation: Gauteng\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo ensure the efficient operation of the dispensary and to ensure service excellence by delivering high standards of Pharmaceutical care in order to meet sales and compliance targets, leading to a competitive advantage for the brand.\n \nJob description\n \nJob Objectives:\nTo provide high standards of pharmaceutical care, accurate and safe dispensing, including generic substitution, and the provision of advice in accordance with Clicks’ way of working, good pharmacy practice and within the legal scope of practice as outlined by the South African Pharmacy Council (SAPC).\nTo efficiently execute all operational activities of the dispensary, including safe and responsible stock management, shrinkage, general housekeeping and administration in line with merchandising, SAPC regulations and company standards.\nTo ensure the operational viability of the dispensary through focusing on core dispensary and clinic targets.\nTo ensure competent and motivated employees by overseeing training and development of Pharmacist Assistants and Pharmacist Interns in line with SAPC requirements when required.\nTo execute customer service initiatives in the dispensary to ensure a great customer experience, driving of customer loyalty and achievement of club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo ensure integration and partnership with the clinic and healthcare aisle resulting in a full offering to customers regarding their healthcare needs.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Registered Pharmacist with SAPC\nDesirable: Retail Pharmacy experience\nDesirable: Unisolve experience\n \nJob Knowledge and Skills Required:\nSAPC and relevant legal knowledge\nEthical working practice and compliance\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of patient care, professional counselling\nKnowledge of customer service excellence\nTutorship and coaching skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nInterpersonal skills (Customer service orientation and effective patient care)\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nFollowing instructions and Procedures\nRelating and networking\nDelivering Results and Meeting Customer Expectations\nRelating and networking\nPlanning and Organising\nCoping with Pressures and Setbacks\nEntrepreneurial and Commercial Thinking\nWorking with people\nAdhering to Principles and Values\n \nKindly note that only applicants who meet the requirements will be contacted.\nWe are committed to the principles of Employment Equity.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nDEPARTMENTAL MANAGER DISPATCH- CENTURION DC\nListing reference: click_017220\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Distribution, Transport & Logistics\nJob category: Dispatching\nLocation: Centurion\nContract: Permanent\nRemuneration: Market related\nEE position: Yes\n \nIntroduction\nTo effectively manage the Dispatch Department achieving/exceeding RTE (Rollertainer Equivalent) utilization targets whilst minimizing damages to stores, accurate recording of paperwork and assets, ensuring compliance to loading and Dispatch processes to achieve on time delivery to store as per schedule and minimize losses.\n \nJob description\nThe role will be responsible to effectively manage a team ensuring adherence to policies and processes and meeting of productivity targets, within a multi-disciplined environment.\n Effectively manage and control Dispatch systems and processes.\nThe achievement of budgeted and agreed financial targets.\nTo ensure effective utilisation of all people resources to drive productivity to targets.\nTo analyse, interpret and report business information in order to facilitate process improvement and improved financial performance.\nTo engage, network and communicate with internal stakeholders, vendors, suppliers and stores to ensure swift query resolution and ensure improved business performance.\nTo deliver high levels of service to stores through accurate, on time deliveries, minimal damages and effective communication\nTo enforce adherence to safety procedures, co-ordinate and manage emergencies ensuring a safe working environment.\nTo lead and direct the department to achieve consistent process compliance and adherence to all relevant company SOPs (Standard operating procedures), cutoffs and daily reports.\nTo ensure weekly meetings with labour brokers to address poor performance, damage to property and or stock, short supply of labour, scheduling issues and control and approval of costs.\nTo manage the HR management component of the department this will include performance management, talent identification and management, disciplinary action and employee wellness.\n \nMinimum requirements\nEducation and experience\n \nEducation:\nEssential: Matric/ Grade 12\nDesirable: relevant qualification (Supply Chain/Logistics)\n \n Experience :\n2 years managerial and administration experience\n2-3 years within a Distribution Centre /logistics environment\nUnderstanding of a Distribution Centre/ Logistics environment\nUnderstanding of the Inbound leg of the supply chain process\nPeople Management\nHealth and safety\nBudgeting\nPeople Management\nDesirable: Budget Management\n \nSkills:\nComputer literacy (minimum excel intermediary level)\nWMS systems and procedures\nCommunication (verbal and written) skills\nBasic financial skills\nAttention to detail\nOrganizing skills\nAnalytical skills\n \nCompetencies:\nLeading and Supervising\nAdhering to Principles and Values\nPlanning and Organizing\nDelivering Results and Meeting Customer Expectations\nFollowing Instructions and Procedures\nDeciding and Initiating Action\nCoping with Pressures and Setbacks\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nPHARMACIST - CLICKS BT NGEBS\nListing reference: click_017224\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Dispensing/Pharmacy\nLocation: Eastern Cape\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo ensure the efficient operation of the dispensary and to ensure service excellence by delivering high standards of Pharmaceutical care in order to meet sales and compliance targets, leading to a competitive advantage for the brand.\n \nJob description\n \nJob Objectives:\nTo provide high standards of pharmaceutical care, accurate and safe dispensing, including generic substitution, and the provision of advice in accordance with Clicks’ way of working, good pharmacy practice and within the legal scope of practice as outlined by the South African Pharmacy Council (SAPC).\nTo efficiently execute all operational activities of the dispensary, including safe and responsible stock management, shrinkage, general housekeeping and administration in line with merchandising, SAPC regulations and company standards.\nTo ensure the operational viability of the dispensary through focusing on core dispensary and clinic targets.\nTo ensure competent and motivated employees by overseeing training and development of Pharmacist Assistants and Pharmacist Interns in line with SAPC requirements when required.\nTo execute customer service initiatives in the dispensary to ensure a great customer experience, driving of customer loyalty and achievement of club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo ensure integration and partnership with the clinic and healthcare aisle resulting in a full offering to customers regarding their healthcare needs.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Registered Pharmacist with SAPC\nDesirable: Retail Pharmacy experience\nDesirable: Unisolve experience\n \nJob Knowledge and Skills Required:\nSAPC and relevant legal knowledge\nEthical working practice and compliance\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of patient care, professional counselling\nKnowledge of customer service excellence\nTutorship and coaching skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nInterpersonal skills (Customer service orientation and effective patient care)\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nFollowing instructions and Procedures\nRelating and networking\nDelivering Results and Meeting Customer Expectations\nRelating and networking\nPlanning and Organising\nCoping with Pressures and Setbacks\nEntrepreneurial and Commercial Thinking\nWorking with people\nAdhering to Principles and Values\n \nContractual hours:\n45hrs 6days\n \nKindly note that only applicants who meet the requirements will be contacted.\nWe are committed to the principles of Employment Equity.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nPHARMACIST - CLICKS MTHATHA PLAZA\nListing reference: click_017225\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Dispensing/Pharmacy\nLocation: Eastern Cape\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo ensure the efficient operation of the dispensary and to ensure service excellence by delivering high standards of Pharmaceutical care in order to meet sales and compliance targets, leading to a competitive advantage for the brand.\n \nJob description\nJob Objectives:\nTo provide high standards of pharmaceutical care, accurate and safe dispensing, including generic substitution, and the provision of advice in accordance with Clicks’ way of working, good pharmacy practice and within the legal scope of practice as outlined by the South African Pharmacy Council (SAPC).\nTo efficiently execute all operational activities of the dispensary, including safe and responsible stock management, shrinkage, general housekeeping and administration in line with merchandising, SAPC regulations and company standards.\nTo ensure the operational viability of the dispensary through focusing on core dispensary and clinic targets.\nTo ensure competent and motivated employees by overseeing training and development of Pharmacist Assistants and Pharmacist Interns in line with SAPC requirements when required.\nTo execute customer service initiatives in the dispensary to ensure a great customer experience, driving of customer loyalty and achievement of club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo ensure integration and partnership with the clinic and healthcare aisle resulting in a full offering to customers regarding their healthcare needs.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Registered Pharmacist with SAPC\nDesirable: Retail Pharmacy experience\nDesirable: Unisolve experience\n \nJob Knowledge and Skills Required:\nSAPC and relevant legal knowledge\nEthical working practice and compliance\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of patient care, professional counselling\nKnowledge of customer service excellence\nTutorship and coaching skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nInterpersonal skills (Customer service orientation and effective patient care)\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nFollowing instructions and Procedures\nRelating and networking\nDelivering Results and Meeting Customer Expectations\nRelating and networking\nPlanning and Organising\nCoping with Pressures and Setbacks\nEntrepreneurial and Commercial Thinking\nWorking with people\nAdhering to Principles and Values\n \nContractual hours:\n45hrs 6days\n \nKindly note that only applicants who meet the requirements will be contacted.\nWe are committed to the principles of Employment Equity.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nASSISTANT STORE MANAGER - CLICKS FRANKFORT\nListing reference: click_017203\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: FMCG & Supply Management\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Free State\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about retail and service excellence? Are you confident to drive sales and build customer loyalty in order to ensure a competitive advantage for the brand? An exciting and challenging opportunity has become available for an Assistant Store Manager. The successful individual will report to the Store Manager.\n \nJob description\nJob Purpose:\nTo support the Store Manager in ensuring the efficient operation of the store and service excellence by driving sales and building customer loyalty in order to meet sales, profit and compliance targets, leading to a competitive advantage for the brand. \n \nJob Objectives:\nTo ensure the achievement of the stores financial performance by driving and maximising sales through the execution of promotional activities and driving cross-selling, up-selling initiatives and superior customer service across the store team.\nTo efficiently execute all operational activities of the store, including expenses, stock management, shrinkage, general housekeeping and administration.\nTo successfully execute in-store visual merchandising, ensuring the in-store presentation and promotional standards are met and that the appearance of the store is in line with the brand image.\nTo support the Store Manager in ensuring staff are motivated and directed to achieve their targets and performance goals and effectively managed in the absence of the store manager.\nTo assist the Store Manager in maintaining the work schedule on a daily basis in line with the Group's labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed.\nTo execute customer service initiatives in store that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo attend to all administrative responsibilities in an efficient manner, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo facilitate the brand being the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Grade 12 (Maths 50% and English 50%)\nEssential: Relevant Retail/Business Management qualification (External applicants)\nDesirable: Degree in Relevant Retail/Business Management\nMinimum 1 years’ experience in an assistant store management role within a retail/FMCG store operations environment or successful completion the Clicks Trainee Store Management Programme\nFinancial management experience (budgets, profit and loss statements, financial ratios, etc.)\n \nJob Knowledge and Skills Required:\nUnderstanding and application of financial management principles\nRetail/FMCG background and understanding of merchandising and promotions principles\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of customer service excellence\nKnowledge of labour legislation and IR practices \nKnowledge of people management\nKnowledge of competency based interviewing\nNumeracy skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\n \nEssential Competencies\nFollowing instructions and procedures\nPlanning and Organising\nDelivering Results and Meeting Customer Expectations\nWorking with people\nAnalysing\nLeading and Supervising\nEntrepreneurial and Commercial Thinking\nCoping with Pressures and Setbacks\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan.  We also encourage people with disabilities to apply\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \n \nPHARMACIST - CLICKS OXFORD STREET\nListing reference: click_017232\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Eastern Cape\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nThe Pharmacist is responsible for providing high standards of pharmaceutical care and dispensary services in accordance with Good Pharmacy Practice as well as certain aspects related to stock and financial management of the pharmacy\n \nJob description\nHigh standards of pharmaceutical service and care\nProvision of advice and pharmacy-initiated therapy\nScheduled substance and dispensary stock control\nEfficient dispensary administration and management\nAccurate and safe dispensing of medication\nHigh standards of housekeeping and merchandise display\nFinancial management and operational viability\nTraining and development of Pharmacist Assistants and Pharmacist Interns\nStaff management and resource planning\nAd hoc responsibilities as required to support the operational requirements of the pharmacy\n \nMinimum requirements\nQualifications and Experience:\nB Pharm\nInternship\nCommunity Service\n \nSkills, Abilities and Job Related Knowledge: \nSAPC and relevant legal knowledge\nCustomer service orientated\nEffective patient care\nProfessional counselling\nIntegrity\nEthical working practice and compliance\nAccuracy and attention to detail\nIT Business Operating Systems\nFinancial Management\nMS Office\nTutorship and Coaching\nTeam Player\n \nEssential Competencies: \nAdhering to Principles and Values\nWorking with People\nDelivering Results and Meeting Customer Expectations\nFollowing instructions and Procedures\nRelating and Networking\n \nKindly note that only applicants who meet the requirements will be contacted.\nWe are committed to the principles of Employment Equity.\n \nAPPLY\n \n \n \n \n \n ", " \n \n \n \n \nPHARMACIST - CLICKS BT NGEBS MALL\nListing reference: click_017223\nListing status: Online\nApply by: 8 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Dispensing/Pharmacy\nLocation: Eastern Cape\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo ensure the efficient operation of the dispensary and to ensure service excellence by delivering high standards of Pharmaceutical care in order to meet sales and compliance targets, leading to a competitive advantage for the brand.\n \nJob description\n \nJob Objectives:\nTo provide high standards of pharmaceutical care, accurate and safe dispensing, including generic substitution, and the provision of advice in accordance with Clicks’ way of working, good pharmacy practice and within the legal scope of practice as outlined by the South African Pharmacy Council (SAPC).\nTo efficiently execute all operational activities of the dispensary, including safe and responsible stock management, shrinkage, general housekeeping and administration in line with merchandising, SAPC regulations and company standards.\nTo ensure the operational viability of the dispensary through focusing on core dispensary and clinic targets.\nTo ensure competent and motivated employees by overseeing training and development of Pharmacist Assistants and Pharmacist Interns in line with SAPC requirements when required.\nTo execute customer service initiatives in the dispensary to ensure a great customer experience, driving of customer loyalty and achievement of club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo ensure integration and partnership with the clinic and healthcare aisle resulting in a full offering to customers regarding their healthcare needs.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Registered Pharmacist with SAPC\nDesirable: Retail Pharmacy experience\nDesirable: Unisolve experience\n \nJob Knowledge and Skills Required:\nSAPC and relevant legal knowledge\nEthical working practice and compliance\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of patient care, professional counselling\nKnowledge of customer service excellence\nTutorship and coaching skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nInterpersonal skills (Customer service orientation and effective patient care)\nComputer literacy\nStrong financial acumen\n \nEssential Competencies\nFollowing instructions and Procedures\nRelating and networking\nDelivering Results and Meeting Customer Expectations\nRelating and networking\nPlanning and Organising\nCoping with Pressures and Setbacks\nEntrepreneurial and Commercial Thinking\nWorking with people\nAdhering to Principles and Values\n \nContractual hours:\n45hrs 6days\n \nKindly note that only applicants who meet the requirements will be contacted.\nWe are committed to the principles of Employment Equity.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nTRAINING FACILITATOR - ROODEPOORT\nListing reference: click_017149\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: FMCG & Supply Management\nJob category: Training and Development\nLocation: Roodepoort\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nThe Clicks Learning & Development Team is looking for a Training Facilitator to deliver learning and development interventions in order to meet current and future organisational needs in line with the business unit operating plan, group learning and development framework and national skills development agenda.\n \nJob description\nTo coordinate the delivery of learning activities in line with the approved calendar, budget and business requirements.\nTo deliver learning and development interventions in line with quality standards in order to achieve learning outcomes and business objectives.\nTo evaluate, monitor and report on learning and development interventions and delivery, in line with quality management standards and business requirements in order to ensure positive business and learner impact as well as continuous improvement.\nTo comply with group policies, quality assurance standards and regulatory requirements.\n \nMinimum requirements\nJob Knowledge:\nLearning methodologies\nLearning and development theories and principles\nSkills Development Act\n \nJob Related Skills:\nFacilitation and presentation skills\nCommunication skills\nPlanning and organising skills\nInterpersonal skills\nAnalysing\nWriting and reporting\nDeciding and Initiating action\nApplying expertise and technology\n \nJob Experience:\nEssential: 2-3 years experience in learning and development as a facilitator\nEssential: Previous involvement in the implementation of accredited learning programmes and related processes and documentation\nDesirable: Experience in a retail environment\n \nEducation:\n3 year Degree / Diploma (HR, B Com, BA or B Soc Sc)\nRegistered Assessor and Moderator\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \n \nPHARMACIST - SOSHANGUVE CROSSING\nListing reference: click_017200\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Pharmaceutical Sector\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Gauteng\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo ensure the efficient operation of the dispensary and to ensure service excellence by delivering high standards of Pharmaceutical care in order to meet sales and compliance targets, leading to a competitive advantage for the brand.\n \nJob description\n \nJob Objectives:\nTo provide high standards of pharmaceutical care, accurate and safe dispensing, including generic substitution, and the provision of advice in accordance with Clicks’ way of working, good pharmacy practice and within the legal scope of practice as outlined by the South African Pharmacy Council (SAPC).\nTo efficiently execute all operational activities of the dispensary, including safe and responsible stock management, shrinkage, general housekeeping and administration in line with merchandising, SAPC regulations and company standards.\nTo ensure the operational viability of the dispensary through focusing on core dispensary and clinic targets.\nTo ensure competent and motivated employees by overseeing training and development of Pharmacist Assistants and Pharmacist Interns in line with SAPC requirements when required.\nTo execute customer service initiatives in the dispensary to ensure a great customer experience, driving of customer loyalty and achievement of club card participation targets.\nTo build and maintain sound working relationships with relevant stakeholders (centre managers, suppliers, DC’s) to ensure business objectives are achieved and opportunities are maximised.\nTo ensure integration and partnership with the clinic and healthcare ailse resulting in a full offering to customers regarding their healthcare needs.\nTo support the Group’s vision to be the customer’s first choice health and beauty retailer by living and driving the company values.\n \nKnowledge:\nSAPC and relevant legal knowledge\nEthical working practice and compliance\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of patient care, professional counselling\nKnowledge of customer service excellence\n \nSkills:\nTutorship and coaching skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nInterpersonal skills (Customer service orientation and effective patient care)\nComputer literacy\nStrong financial acumen\n \nCompetencies:\nEssential:\nFollowing instructions and Procedures\nRelating and networking\nDelivering Results and Meeting Customer Expectations\n \nDesirable:\nRelating and networking\nPlanning and Organising\nCoping with Pressures and Setbacks\nEntrepreneurial and Commercial Thinking\nWorking with people\nAdhering to Principles and Values\n \nMinimum requirements\nExperience:\nRetail Pharmacy experience\nUnisolve experience\n \nEducation:\nEssential: Registered Pharmacist with SAPC\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \n \nWELLNESS ASSISTANT - CLICKS MACLEAN STREET\nListing reference: click_017210\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: East London\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\n \nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \n \nWELLNESS ASSISTANT - CLICKS VOLKSRUST\nListing reference: click_017211\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Kwazulu Natal\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\n \nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nWELLNESS ASSISTANT - CLICKS PORT SHEPSTONE\nListing reference: click_017205\nListing status: Online\nApply by: 7 July 2024\n \nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Hibiscus Coast / South Coast\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\n \nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \nWELLNESS ASSISTANT - CLICKS THE QUARRY\nListing reference: click_017214\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Midlands\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\n \nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n ", " \n \n \n \n \nPHARMACIST ASSISTANT QPB - DE KORNVLIJ\nListing reference: click_017215\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Pharmaceutical Sector\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Malmesbury\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nResponsible for providing pharmaceutical care services (within scope of practice) and performing day-to-day dispensary administration according to company's Standard Operating Plans (SOPs). To focus on the administration of scripts to provide general dispensing duties with the emphasis on patient satisfaction\n \nJob description\n \nJob Objectives:\nResponsibilities\n·       Interact with customers in a professional manner and with strict confidentiality within SOP and agreed timelines\n·       Administration of scripts and or any other claiming/capturing related procedure\n·       Accurate and complete handling of all profiles worked on\n·       Interact with health care professionals where needed\n·       Problem solving and follow up of queries\n \nDuties\n·       Interact with customers via telephone or other means regarding medication and Healthcare Services\n·       Accurate capturing of scripts received at the Central Pharmacy centre\n·       Handling of queries regarding prescriptions\n·       Patient Profile management\n·       Assist with Chronic authorizations\n·       Liaison with all other departments\n·       Ad hoc requirements as per operational requirements\n \nKnowledge:\n·       Product knowledge (including OTC)\n·       SAPC and relevant legal knowledge\n·       Sound knowledge of the chronic authorization process and procedures\n·       Customer service orientated\n·       Ethical working practice and compliance\n \nSkills:\n·       Computer literacy (MS Office)\n·       Customer service orientated\n·       Team Player\n·       Integrity\n·       Accuracy and attention to detail\n·       Computer literacy (MS Office)\n·       Must be bilingual (with English being one of the requirements\n·       Must be able to work with patients and be adaptable to assist with various departmental duties\n·       Be able to use initiative in order to provide patient satisfaction\n·       Effective time management skills\n·       Adaptability\n·       Positive attitude\n·       Be able to work under pressure\n \nCompetencies:\nEssential\nAdhering to Principles and Values\nWorking with People\nDelivering Results and Meeting Customer Expectations\n \nMinimum requirements\nExperience:\n·       Minimum 1 year in the role of Pharmacist Assistant Post Basic\n \nEducation:\n·       Further Education and Training Certificate Pharmacist Assistance (Essential)\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n ", " \n \n \n \n \nWELLNESS ASSISTANT - CLICKS QUEENSTOWN\nListing reference: click_017207\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Queenstown\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n \n ", " \n \n \n \n \nWELLNESS ASSISTANT - CLICKS PORT EDWARD\nListing reference: click_017208\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Kwazulu Natal\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY\n \n \n \n \n \n ", " \n \n \n \n \nSALES ADVISOR (27-40HR) - THE BODY SHOP CLEARWATER (FIXED TERM CONTRACT)\nListing reference: click_017198\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Retail Operations\nLocation: Gauteng\nContract: Fixed Term Contract\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nThe main purpose of the job is to offer exceptional customer service by providing detailed product knowledge and maximising sales through effective cross and up selling.\n \nJob description\n Job Objectives:\nTo drive sales of the store through cross and up selling.\nTo reduce loss and shrinkage in store by adhering to Store Operating Procedure.\nTo create an appealing shopping environment for customers.\nTo maximise sales by taking ownership of the execution of all promotional events and daily requirements in store.\nTo increase profitability and brand loyalty with customers.\nTo ensure continuity of excellent customer service.\nMinimum requirements \nEssential Competencies:\nCommunication skills.\nCustomer service skills.\nListening and interpersonal skills.\nProblem solving ability.\n \nQualifications and Experience: \nMatric/Grade 12 (essential).\nExperience in cosmetics.\nRetail in sales or service environment (desirable).\n \nSkills, Abilities and Job Related Knowledge:\nGood understanding of retail principles.\nBe able to interact with customers effectively.\nAbility to apply selling skills.\nComputer literate.\nGood understanding of stock management principles.\n \nAPPLY\n \n \n \n \n ", "ASSISTANT STORE MANAGER - CLICKS JOZINI\nListing reference: click_017228\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: FMCG, Retail, Wholesale and Supply Chain\nLocation: Kwazulu Natal\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nAre you passionate about retail and service excellence? Are you confident to drive sales and build customer loyalty in order to ensure a competitive advantage for the brand? An exciting and challenging opportunity has become available for an Assistant Store Manager. The successful individual will report to the Store Manager.\n \nJob description\nJob Purpose:\nTo support the Store Manager in ensuring the efficient operation of the store and service excellence by driving sales and building customer loyalty in order to meet sales, profit and compliance targets, leading to a competitive advantage for the brand. \n \nJob Objectives:\nTo ensure the achievement of the stores financial performance by driving and maximising sales through the execution of promotional activities and driving cross-selling, up-selling initiatives and superior customer service across the store team.\nTo efficiently execute all operational activities of the store, including expenses, stock management, shrinkage, general housekeeping and administration.\nTo successfully execute in-store visual merchandising, ensuring the in-store presentation and promotional standards are met and that the appearance of the store is in line with the brand image.\nTo support the Store Manager in ensuring staff are motivated and directed to achieve their targets and performance goals and effectively managed in the absence of the store manager.\nTo assist the Store Manager in maintaining the work schedule on a daily basis in line with the Group's labour policy and the relevant labour model in order to ensure each department is fully and appropriately staffed.\nTo execute customer service initiatives in store that results in a great customer experience, drives customer loyalty and achieves club card participation targets.\nTo attend to all administrative responsibilities in an efficient manner, including ensuring weekly time and attendance and employee records are complete and submitted to HR.\nTo facilitate the brand being the customer’s first choice health and beauty retailer by living and driving the company values.\n \nMinimum requirements\nEducation and Experience Requirements:\nEssential: Grade 12 (Maths 50% and English 50%)\nEssential: Relevant Retail/Business Management qualification (External applicants)\nDesirable: Degree in Relevant Retail/Business Management\nMinimum 1 years’ experience in an assistant store management role within a retail/FMCG store operations environment or successful completion the Clicks Trainee Store Management Programme\nFinancial management experience (budgets, profit and loss statements, financial ratios, etc.)\n \nJob Knowledge and Skills Required:\nUnderstanding and application of financial management principles\nRetail/FMCG background and understanding of merchandising and promotions principles\nKnowledge of stock, cost, risk and compliance management procedures \nKnowledge of customer service excellence\nKnowledge of labour legislation and IR practices \nKnowledge of people management\nKnowledge of competency based interviewing\nNumeracy skills\nResults and target driven\nPlanning and organising skills\nProblem-solving skills\nStrong customer orientation\nGood communication skills\nComputer literacy\n \nEssential Competencies\nFollowing instructions and procedures\nPlanning and Organising\nDelivering Results and Meeting Customer Expectations\nWorking with people\nAnalysing\nLeading and Supervising\nEntrepreneurial and Commercial Thinking\nCoping with Pressures and Setbacks\n \nContractual hours:\n45hr 6day\n \nKindly note only applicants who meet the minimum requirements will be contacted.\nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply\n \nAPPLY", "WELLNESS ASSISTANT - CLICKS ESIKHAWINI\nListing reference: click_017213\nListing status: Online\nApply by: 7 July 2024\nPosition summary\nIndustry: Wholesale & Retail Trade\nJob category: Other: Health, Fitness, Medical and Optometry\nLocation: Hibiscus Coast / South Coast\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nTo offer exceptional service to all customers by providing knowledgeable service and basic advice on healthcare, nutrition and supplementation in order to maximise sales and build customer loyalty.\n \nJob description\nJob Objectives:\nTo deliver exceptional customer service through in-store visibility and proactivity to customer needs through knowledge and understanding of health and supplements.\nTo consult with customers and provide suitable advice on healthcare, nutritional and supplement products.\nTo drive healthcare sales in line with targets through promotion of a broad range of brands by cross selling and upselling to increase profitability.\nTo drive stock availability in the healthcare aisles through compliance with stock management principles and procedures in order to drive sales.\nTo prevent wastage in own area by adhering to stock rotation principles.\nTo prevent stock losses by following all risk management policies and principles.\nTo ensure high standards of hygiene and cleanliness within the store in order to create an appealing shopping environment for customers.\nTo assist in product merchandising by following the merchandising guidelines and procedures.\nTo adhere to all store standard operating procedures.\nTo ensure continuity of service by focusing on own development and product knowledge and sharing product information with relief staff.\n \nMinimum requirements\nJob Knowledge:\nEssential: Basic health, fitness and supplements product knowledge\nEssential: Basic knowledge of retail store operations principles (stock management, merchandising, risk management,)\n \nJob Related Skills:\nEssential: Good communication and interaction skills\nEssential: Customer and service orientation\nEssential: Selling skills\nEssential: Merchandising skills\nDesirable: Basic computer literacy\n \nJob Experience:\nEssential: At least 1 year related experience\nEssential: Experience working with sports nutrition and vitamin related products\nEssential: Selling skills; customer related training\n \nEducation:\nEssential: Matric (50% pure/ 60% lit)\nEssential: English 50%\nEssential: Pass in Life Science/Physics\nDesirable: Sports / fitness / nutrition qualification\n \nCompetencies\nEssential\nRelating and Networking\nPersuading and Influencing\nFollowing Instructions and Procedures\nDelivering Results and Meeting Customer Expectations\nPresenting and Communicating Information\nAchieving Personal Work Goals and Objectives\n \nDesirable\nCoping with Pressures and Setbacks\nAdapting and Responding to Change\nAdhering to Principles and Values\nPlanning and Organising\nWorking with People \n \nContractual hours:\n27 - 40hrs\n \nKindly note only applicants who meet the minimum requirements will be contacted.\n \nAll positions will be filled in accordance with our Employment Equity plan. We also encourage people with disabilities to apply.\n \nAPPLY"], "postedDate": "4/7/2024", "iframe": "", "uuid": "pd7601a7e-9e74-472a-be9c-4cfa87a40035"}], "businesses": {"volkswagen group is hiring": "https://www.govpage.co.za/private-sector-jobs/volkswagen-group-is-hiring", "gold fields is hiring": "https://www.govpage.co.za/private-sector-jobs/gold-fields-is-hiring", "glencore is hiring": "https://www.govpage.co.za/private-sector-jobs/glencore-is-hiring5185584", "de beers group is hiring": "https://www.govpage.co.za/private-sector-jobs/de-beers-group-is-hiring6012171", "clicks group limited is hiring": "https://www.govpage.co.za/private-sector-jobs/clicks-group-limited-is-hiring5039000", "netcare is hiring": "https://www.govpage.co.za/private-sector-jobs/netcare-is-hiring8517825", "tsogo sun is hiring": "https://www.govpage.co.za/private-sector-jobs/june-21st-2024", "heineken beverages is hiring": "https://www.govpage.co.za/private-sector-jobs/heineken-beverages-is-hiring6377091", "omoda is hiring": "https://www.govpage.co.za/private-sector-jobs/omoda-is-hiring", "tiger brands is hiring": "https://www.govpage.co.za/private-sector-jobs/tiger-brands-is-hiring8362853", "old mutual is hiring": "https://www.govpage.co.za/private-sector-jobs/old-mutual-is-hiring4538730", "unilever is hiring": "https://www.govpage.co.za/private-sector-jobs/unilever-is-hiring4756500", "takealot is hiring": "https://www.govpage.co.za/private-sector-jobs/takealot-is-hiring8119691", "nestle is hiring": "https://www.govpage.co.za/private-sector-jobs/nestle-is-hiring2197750", "bat south africa is hiring": "https://www.govpage.co.za/private-sector-jobs/bat-south-africa-is-hiring6247942", "spitz is hiring": "https://www.govpage.co.za/private-sector-jobs/spitz-is-hiring5937277", "discovery is hiring": "https://www.govpage.co.za/private-sector-jobs/discovery-is-hiring8553767", "de beers roup is hiring": "https://www.govpage.co.za/private-sector-jobs/de-beers-roup-is-hiring", "the capital hotels | aprtments | resorts is hiring": "https://www.govpage.co.za/private-sector-jobs/the-capital-hotels-aprtments-resorts-is-hiring", "smith+nephew is hiring": "https://www.govpage.co.za/private-sector-jobs/smithnephew-is-hiring2824456", "roche is hiring": "https://www.govpage.co.za/private-sector-jobs/roche-is-hiring7759491", "abbot is hiring": "https://www.govpage.co.za/private-sector-jobs/abbot-is-hiring8679015", "tsogo sun casinos and hotels is hiring": "https://www.govpage.co.za/private-sector-jobs/tsogo-sun-casinos-and-hotels-is-hiring"}}, "current_business_index": 5}